nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*
 * Copyright 2017-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/* Define the PIO[ANAMODE] bit macro (SDK 2.6.x and older miss this bit macro definition) */
#ifndef IOCON_PIO_ANAMODE_MASK
#define IOCON_PIO_ANAMODE_MASK  (0x40U)
#define IOCON_PIO_ANAMODE_SHIFT (6U)
#define IOCON_PIO_ANAMODE(x)    (((uint32_t)(((uint32_t)(x)) << IOCON_PIO_ANAMODE_SHIFT)) & IOCON_PIO_ANAMODE_MASK)
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

#define PIO04_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO04_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO05_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO05_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO06_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO06_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO11_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO11_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO0_6 (coord A5), U28[C8]/RP5[4]/SW2/P0_6-ISP2/P0_6-EMC_D4
  @{ */
/* Routed pin properties */
#define BOARD_SW2_PERIPHERAL GPIO                                  /*!<@brief Peripheral name */
#define BOARD_SW2_SIGNAL PIO0                                      /*!<@brief Signal name */
#define BOARD_SW2_CHANNEL 6                                        /*!<@brief Signal channel */
#define BOARD_SW2_PIN_NAME PIO0_6                                  /*!<@brief Routed pin name */
#define BOARD_SW2_LABEL "U28[C8]/RP5[4]/SW2/P0_6-ISP2/P0_6-EMC_D4" /*!<@brief Label */
#define BOARD_SW2_NAME "SW2"                                       /*!<@brief Identifier */
#define BOARD_SW2_DIRECTION kPIN_MUX_DirectionInput                /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_SW2_GPIO GPIO                                        /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW2_GPIO_PIN 6U                                      /*!<@brief GPIO pin number */
#define BOARD_SW2_GPIO_PIN_MASK (1U << 6U)                         /*!<@brief GPIO pin mask */
#define BOARD_SW2_PORT 0U                                          /*!<@brief PORT peripheral base pointer */
#define BOARD_SW2_PIN 6U                                           /*!<@brief PORT pin number */
#define BOARD_SW2_PIN_MASK (1U << 6U)                              /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO0_5 (coord E7), U28[C9]/RP3[1]/JS32[1]/SW3/P0_5-ISP1/P0_5-EMC_D3
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_SW3_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_SW3_SIGNAL PIO0
/*!
 * @brief Signal channel */
#define BOARD_SW3_CHANNEL 5
/*!
 * @brief Routed pin name */
#define BOARD_SW3_PIN_NAME PIO0_5
/*!
 * @brief Label */
#define BOARD_SW3_LABEL "U28[C9]/RP3[1]/JS32[1]/SW3/P0_5-ISP1/P0_5-EMC_D3"
/*!
 * @brief Identifier */
#define BOARD_SW3_NAME "SW3"
/*!
 * @brief Direction */
#define BOARD_SW3_DIRECTION kPIN_MUX_DirectionInput

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_SW3_GPIO GPIO
/*!
 * @brief GPIO pin number */
#define BOARD_SW3_GPIO_PIN 5U
/*!
 * @brief GPIO pin mask */
#define BOARD_SW3_GPIO_PIN_MASK (1U << 5U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_SW3_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_SW3_PIN 5U
/*!
 * @brief PORT pin mask */
#define BOARD_SW3_PIN_MASK (1U << 5U)
/* @} */

/*! @name PIO0_4 (coord C8), U28[B8]/RP3[2]/JS32[3]/SW4/P0_4-ISP0/P0_4-EMC_D2
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_SW4_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_SW4_SIGNAL PIO0
/*!
 * @brief Signal channel */
#define BOARD_SW4_CHANNEL 4
/*!
 * @brief Routed pin name */
#define BOARD_SW4_PIN_NAME PIO0_4
/*!
 * @brief Label */
#define BOARD_SW4_LABEL "U28[B8]/RP3[2]/JS32[3]/SW4/P0_4-ISP0/P0_4-EMC_D2"
/*!
 * @brief Identifier */
#define BOARD_SW4_NAME "SW4"
/*!
 * @brief Direction */
#define BOARD_SW4_DIRECTION kPIN_MUX_DirectionInput

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_SW4_GPIO GPIO
/*!
 * @brief GPIO pin number */
#define BOARD_SW4_GPIO_PIN 4U
/*!
 * @brief GPIO pin mask */
#define BOARD_SW4_GPIO_PIN_MASK (1U << 4U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_SW4_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_SW4_PIN 4U
/*!
 * @brief PORT pin mask */
#define BOARD_SW4_PIN_MASK (1U << 4U)
/* @} */

/*! @name PIO1_1 (coord K12), J12[12]/U29[4]/SW5/P1_1-USER_PB-USB1_OVRCURn
  @{ */
/* Routed pin properties */
#define BOARD_SW5_PERIPHERAL GPIO                                      /*!<@brief Peripheral name */
#define BOARD_SW5_SIGNAL PIO1                                          /*!<@brief Signal name */
#define BOARD_SW5_CHANNEL 1                                            /*!<@brief Signal channel */
#define BOARD_SW5_PIN_NAME PIO1_1                                      /*!<@brief Routed pin name */
#define BOARD_SW5_LABEL "J12[12]/U29[4]/SW5/P1_1-USER_PB-USB1_OVRCURn" /*!<@brief Label */
#define BOARD_SW5_NAME "SW5"                                           /*!<@brief Identifier */
#define BOARD_SW5_DIRECTION kPIN_MUX_DirectionInput                    /*!<@brief Direction */

