nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_SW5_GPIO GPIO                                            /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW5_GPIO_PIN 1U                                          /*!<@brief GPIO pin number */
#define BOARD_SW5_GPIO_PIN_MASK (1U << 1U)                             /*!<@brief GPIO pin mask */
#define BOARD_SW5_PORT 1U                                              /*!<@brief PORT peripheral base pointer */
#define BOARD_SW5_PIN 1U                                               /*!<@brief PORT pin number */
#define BOARD_SW5_PIN_MASK (1U << 1U)                                  /*!<@brief PORT pin mask */
                                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void); /* Function assigned for the Cortex-M4F */

#define PIO22_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO22_FUNC_ALT0 0x00u         /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO314_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO314_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO33_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO33_FUNC_ALT0 0x00u         /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO3_3 (coord A13), J9[8]/LED2/P3_3-USR_LED2
  @{ */
/* Routed pin properties */
#define BOARD_LED2_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_LED2_SIGNAL PIO3                        /*!<@brief Signal name */
#define BOARD_LED2_CHANNEL 3                          /*!<@brief Signal channel */
#define BOARD_LED2_PIN_NAME PIO3_3                    /*!<@brief Routed pin name */
#define BOARD_LED2_LABEL "J9[8]/LED2/P3_3-USR_LED2"   /*!<@brief Label */
#define BOARD_LED2_NAME "LED2"                        /*!<@brief Identifier */
#define BOARD_LED2_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_LED2_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED2_GPIO_PIN 3U                        /*!<@brief GPIO pin number */
#define BOARD_LED2_GPIO_PIN_MASK (1U << 3U)           /*!<@brief GPIO pin mask */
#define BOARD_LED2_PORT 3U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_LED2_PIN 3U                             /*!<@brief PORT pin number */
#define BOARD_LED2_PIN_MASK (1U << 3U)                /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO2_2 (coord C3), J9[6]/LED3/P2_2-CT1MAT1-USR_LED3
  @{ */
/* Routed pin properties */
#define BOARD_LED3_PERIPHERAL GPIO                          /*!<@brief Peripheral name */
#define BOARD_LED3_SIGNAL PIO2                              /*!<@brief Signal name */
#define BOARD_LED3_CHANNEL 2                                /*!<@brief Signal channel */
#define BOARD_LED3_PIN_NAME PIO2_2                          /*!<@brief Routed pin name */
#define BOARD_LED3_LABEL "J9[6]/LED3/P2_2-CT1MAT1-USR_LED3" /*!<@brief Label */
#define BOARD_LED3_NAME "LED3"                              /*!<@brief Identifier */
#define BOARD_LED3_DIRECTION kPIN_MUX_DirectionOutput       /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_LED3_GPIO GPIO                                /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED3_GPIO_PIN 2U                              /*!<@brief GPIO pin number */
#define BOARD_LED3_GPIO_PIN_MASK (1U << 2U)                 /*!<@brief GPIO pin mask */
#define BOARD_LED3_PORT 2U                                  /*!<@brief PORT peripheral base pointer */
#define BOARD_LED3_PIN 2U                                   /*!<@brief PORT pin number */
#define BOARD_LED3_PIN_MASK (1U << 2U)                      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO3_14 (coord E3), J13[5]/LED1/P3_14-CT3MAT1-USR_LED1
  @{ */
/* Routed pin properties */
#define BOARD_LED1_PERIPHERAL GPIO                            /*!<@brief Peripheral name */
#define BOARD_LED1_SIGNAL PIO3                                /*!<@brief Signal name */
#define BOARD_LED1_CHANNEL 14                                 /*!<@brief Signal channel */
#define BOARD_LED1_PIN_NAME PIO3_14                           /*!<@brief Routed pin name */
#define BOARD_LED1_LABEL "J13[5]/LED1/P3_14-CT3MAT1-USR_LED1" /*!<@brief Label */
#define BOARD_LED1_NAME "LED1"                                /*!<@brief Identifier */
#define BOARD_LED1_DIRECTION kPIN_MUX_DirectionOutput         /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_LED1_GPIO GPIO                                  /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED1_GPIO_PIN 14U                               /*!<@brief GPIO pin number */
#define BOARD_LED1_GPIO_PIN_MASK (1U << 14U)                  /*!<@brief GPIO pin mask */
#define BOARD_LED1_PORT 3U                                    /*!<@brief PORT peripheral base pointer */
#define BOARD_LED1_PIN 14U                                    /*!<@brief PORT pin number */
#define BOARD_LED1_PIN_MASK (1U << 14U)                       /*!<@brief PORT pin mask */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void); /* Function assigned for the Cortex-M4F */

#define PIO00_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO00_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO013_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO013_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO014_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO014_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO01_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO01_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO02_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO02_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO03_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO03_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO313_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO313_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO0_1 (coord A1), U26[14]/J14[1]/P0_1-ISP_FC3_SSEL0
  @{ */
/* Routed pin properties */
#define BOARD_ISP_FC3_SSEL0_PERIPHERAL FLEXCOMM3                      /*!<@brief Peripheral name */
#define BOARD_ISP_FC3_SSEL0_SIGNAL CTS_SDA_SSEL0                      /*!<@brief Signal name */
#define BOARD_ISP_FC3_SSEL0_PIN_NAME FC3_CTS_SDA_SSEL0                /*!<@brief Routed pin name */
#define BOARD_ISP_FC3_SSEL0_LABEL "U26[14]/J14[1]/P0_1-ISP_FC3_SSEL0" /*!<@brief Label */
#define BOARD_ISP_FC3_SSEL0_NAME "ISP_FC3_SSEL0"                      /*!<@brief Identifier */
#define BOARD_ISP_FC3_SSEL0_DIRECTION kPIN_MUX_DirectionOutput        /*!<@brief Direction */
#define BOARD_ISP_FC3_SSEL0_PORT 0U                                   /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC3_SSEL0_PIN 1U                                    /*!<@brief PORT pin number */
#define BOARD_ISP_FC3_SSEL0_PIN_MASK (1U << 1U)                       /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO0_3 (coord A10), U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_ISP_FC3_MOSI_PERIPHERAL FLEXCOMM3
/*!
 * @brief Signal name */
#define BOARD_ISP_FC3_MOSI_SIGNAL RXD_SDA_MOSI
/*!
 * @brief Routed pin name */
#define BOARD_ISP_FC3_MOSI_PIN_NAME FC3_RXD_SDA_MOSI
/*!
 * @brief Label */
#define BOARD_ISP_FC3_MOSI_LABEL "U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1"
/*!
 * @brief Identifier */
#define BOARD_ISP_FC3_MOSI_NAME "ISP_FC3_MOSI"
/*!
 * @brief Direction */
#define BOARD_ISP_FC3_MOSI_DIRECTION kPIN_MUX_DirectionOutput
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_ISP_FC3_MOSI_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_ISP_FC3_MOSI_PIN 3U
/*!
 * @brief PORT pin mask */
#define BOARD_ISP_FC3_MOSI_PIN_MASK (1U << 3U)
/* @} */

