nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*! @name PIO0_2 (coord E9), U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_ISP_FC3_MISO_PERIPHERAL FLEXCOMM3
/*!
 * @brief Signal name */
#define BOARD_ISP_FC3_MISO_SIGNAL TXD_SCL_MISO
/*!
 * @brief Routed pin name */
#define BOARD_ISP_FC3_MISO_PIN_NAME FC3_TXD_SCL_MISO
/*!
 * @brief Label */
#define BOARD_ISP_FC3_MISO_LABEL "U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0"
/*!
 * @brief Identifier */
#define BOARD_ISP_FC3_MISO_NAME "ISP_FC3_MISO"
/*!
 * @brief Direction */
#define BOARD_ISP_FC3_MISO_DIRECTION kPIN_MUX_DirectionInput
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_ISP_FC3_MISO_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_ISP_FC3_MISO_PIN 2U
/*!
 * @brief PORT pin mask */
#define BOARD_ISP_FC3_MISO_PIN_MASK (1U << 2U)
/* @} */

/*! @name PIO0_0 (coord D6), U26[13]/J14[4]/P0_0-ISP_FC3_SCK
  @{ */
/* Routed pin properties */
#define BOARD_ISP_FC3_SCK_PERIPHERAL FLEXCOMM3                    /*!<@brief Peripheral name */
#define BOARD_ISP_FC3_SCK_SIGNAL SCK                              /*!<@brief Signal name */
#define BOARD_ISP_FC3_SCK_PIN_NAME FC3_SCK                        /*!<@brief Routed pin name */
#define BOARD_ISP_FC3_SCK_LABEL "U26[13]/J14[4]/P0_0-ISP_FC3_SCK" /*!<@brief Label */
#define BOARD_ISP_FC3_SCK_NAME "ISP_FC3_SCK"                      /*!<@brief Identifier */
#define BOARD_ISP_FC3_SCK_DIRECTION kPIN_MUX_DirectionOutput      /*!<@brief Direction */
#define BOARD_ISP_FC3_SCK_PORT 0U                                 /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC3_SCK_PIN 0U                                  /*!<@brief PORT pin number */
#define BOARD_ISP_FC3_SCK_PIN_MASK (1U << 0U)                     /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO3_13 (coord H4), J14[8]/P3_13-BRIDGE_GPIO
  @{ */
/* Routed pin properties */
#define BOARD_BRIDGE_GPIO_PERIPHERAL GPIO                  /*!<@brief Peripheral name */
#define BOARD_BRIDGE_GPIO_SIGNAL PIO3                      /*!<@brief Signal name */
#define BOARD_BRIDGE_GPIO_CHANNEL 13                       /*!<@brief Signal channel */
#define BOARD_BRIDGE_GPIO_PIN_NAME PIO3_13                 /*!<@brief Routed pin name */
#define BOARD_BRIDGE_GPIO_LABEL "J14[8]/P3_13-BRIDGE_GPIO" /*!<@brief Label */
#define BOARD_BRIDGE_GPIO_NAME "BRIDGE_GPIO"               /*!<@brief Identifier */

/* Symbols to be used with GPIO driver */
#define BOARD_BRIDGE_GPIO_GPIO GPIO                        /*!<@brief GPIO peripheral base pointer */
#define BOARD_BRIDGE_GPIO_GPIO_PIN 13U                     /*!<@brief GPIO pin number */
#define BOARD_BRIDGE_GPIO_GPIO_PIN_MASK (1U << 13U)        /*!<@brief GPIO pin mask */
#define BOARD_BRIDGE_GPIO_PORT 3U                          /*!<@brief PORT peripheral base pointer */
#define BOARD_BRIDGE_GPIO_PIN 13U                          /*!<@brief PORT pin number */
#define BOARD_BRIDGE_GPIO_PIN_MASK (1U << 13U)             /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO0_13 (coord F11), JS16[2]/J14[9]/P0_13-ISP_FC1_SDAX
  @{ */
/* Routed pin properties */
#define BOARD_ISP_FC1_SDAX_PERIPHERAL FLEXCOMM1                      /*!<@brief Peripheral name */
#define BOARD_ISP_FC1_SDAX_SIGNAL CTS_SDA_SSEL0                      /*!<@brief Signal name */
#define BOARD_ISP_FC1_SDAX_PIN_NAME FC1_CTS_SDA_SSEL0                /*!<@brief Routed pin name */
#define BOARD_ISP_FC1_SDAX_LABEL "JS16[2]/J14[9]/P0_13-ISP_FC1_SDAX" /*!<@brief Label */
#define BOARD_ISP_FC1_SDAX_NAME "ISP_FC1_SDAX"                       /*!<@brief Identifier */
#define BOARD_ISP_FC1_SDAX_PORT 0U                                   /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC1_SDAX_PIN 13U                                   /*!<@brief PORT pin number */
#define BOARD_ISP_FC1_SDAX_PIN_MASK (1U << 13U)                      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO0_14 (coord E13), JS15[2]/J14[10]/P0_14-ISP_FC1_SCLX
  @{ */
/* Routed pin properties */
#define BOARD_ISP_FC1_SCLX_PERIPHERAL FLEXCOMM1                       /*!<@brief Peripheral name */
#define BOARD_ISP_FC1_SCLX_SIGNAL RTS_SCL_SSEL1                       /*!<@brief Signal name */
#define BOARD_ISP_FC1_SCLX_PIN_NAME FC1_RTS_SCL_SSEL1                 /*!<@brief Routed pin name */
#define BOARD_ISP_FC1_SCLX_LABEL "JS15[2]/J14[10]/P0_14-ISP_FC1_SCLX" /*!<@brief Label */
#define BOARD_ISP_FC1_SCLX_NAME "ISP_FC1_SCLX"                        /*!<@brief Identifier */
#define BOARD_ISP_FC1_SCLX_PORT 0U                                    /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC1_SCLX_PIN 14U                                    /*!<@brief PORT pin number */
#define BOARD_ISP_FC1_SCLX_PIN_MASK (1U << 14U)                       /*!<@brief PORT pin mask */
                                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPMod_SPI_I2C_BRIDGEPins(void); /* Function assigned for the Cortex-M4F */

#define PIO323_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO323_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO324_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO324_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO34_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO34_FUNC_ALT0 0x00u         /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO3_23 (coord C2), J11[10]/J9[3]/U10[3]/J17[5]/U19[10]/P3_23-FC2_SDAX
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_FC2_SDAX_PERIPHERAL FLEXCOMM2
/*!
 * @brief Signal name */
#define BOARD_FC2_SDAX_SIGNAL CTS_SDA_SSEL0
/*!
 * @brief Routed pin name */
#define BOARD_FC2_SDAX_PIN_NAME FC2_CTS_SDA_SSEL0
/*!
 * @brief Label */
#define BOARD_FC2_SDAX_LABEL "J11[10]/J9[3]/U10[3]/J17[5]/U19[10]/P3_23-FC2_SDAX"
/*!
 * @brief Identifier */
#define BOARD_FC2_SDAX_NAME "FC2_SDAX"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_FC2_SDAX_PORT 3U
/*!
 * @brief PORT pin number */
#define BOARD_FC2_SDAX_PIN 23U
/*!
 * @brief PORT pin mask */
#define BOARD_FC2_SDAX_PIN_MASK (1U << 23U)
/* @} */

