nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*! @name PIO3_24 (coord E2), J11[9]/J9[1]/U10[2]/J17[4]/U19[2]/P3_24-FC2_SCLX
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_FC2_SCLX_PERIPHERAL FLEXCOMM2
/*!
 * @brief Signal name */
#define BOARD_FC2_SCLX_SIGNAL RTS_SCL_SSEL1
/*!
 * @brief Routed pin name */
#define BOARD_FC2_SCLX_PIN_NAME FC2_RTS_SCL_SSEL1
/*!
 * @brief Label */
#define BOARD_FC2_SCLX_LABEL "J11[9]/J9[1]/U10[2]/J17[4]/U19[2]/P3_24-FC2_SCLX"
/*!
 * @brief Identifier */
#define BOARD_FC2_SCLX_NAME "FC2_SCLX"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_FC2_SCLX_PORT 3U
/*!
 * @brief PORT pin number */
#define BOARD_FC2_SCLX_PIN 24U
/*!
 * @brief PORT pin mask */
#define BOARD_FC2_SCLX_PIN_MASK (1U << 24U)
/* @} */

/*! @name PIO3_4 (coord B11), J12[10]/U19[3]/P3_4-ACCL_INTR
  @{ */
/* Routed pin properties */
#define BOARD_ACCL_INTR_PERIPHERAL GPIO                       /*!<@brief Peripheral name */
#define BOARD_ACCL_INTR_SIGNAL PIO3                           /*!<@brief Signal name */
#define BOARD_ACCL_INTR_CHANNEL 4                             /*!<@brief Signal channel */
#define BOARD_ACCL_INTR_PIN_NAME PIO3_4                       /*!<@brief Routed pin name */
#define BOARD_ACCL_INTR_LABEL "J12[10]/U19[3]/P3_4-ACCL_INTR" /*!<@brief Label */
#define BOARD_ACCL_INTR_NAME "ACCL_INTR"                      /*!<@brief Identifier */
#define BOARD_ACCL_INTR_DIRECTION kPIN_MUX_DirectionInput     /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_ACCL_INTR_GPIO GPIO                             /*!<@brief GPIO peripheral base pointer */
#define BOARD_ACCL_INTR_GPIO_PIN 4U                           /*!<@brief GPIO pin number */
#define BOARD_ACCL_INTR_GPIO_PIN_MASK (1U << 4U)              /*!<@brief GPIO pin mask */
#define BOARD_ACCL_INTR_PORT 3U                               /*!<@brief PORT peripheral base pointer */
#define BOARD_ACCL_INTR_PIN 4U                                /*!<@brief PORT pin number */
#define BOARD_ACCL_INTR_PIN_MASK (1U << 4U)                   /*!<@brief PORT pin mask */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void); /* Function assigned for the Cortex-M4F */

#define PIO023_ANAMODE_DISABLED 0x01u /*!<@brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO023_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO023_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO024_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO024_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO025_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO025_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO026_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO026_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO027_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO027_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO028_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO028_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO212_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO212_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO0_26 (coord M13), J13[2]/U27[6]/P0_26-SPIFI_CLK
  @{ */
/* Routed pin properties */
#define BOARD_SPIFI_CLK_PERIPHERAL SPIFI0                     /*!<@brief Peripheral name */
#define BOARD_SPIFI_CLK_SIGNAL SPIFI_SCK                      /*!<@brief Signal name */
#define BOARD_SPIFI_CLK_PIN_NAME SPIFI_CLK                    /*!<@brief Routed pin name */
#define BOARD_SPIFI_CLK_LABEL "J13[2]/U27[6]/P0_26-SPIFI_CLK" /*!<@brief Label */
#define BOARD_SPIFI_CLK_NAME "SPIFI_CLK"                      /*!<@brief Identifier */
#define BOARD_SPIFI_CLK_PORT 0U                               /*!<@brief PORT peripheral base pointer */
#define BOARD_SPIFI_CLK_PIN 26U                               /*!<@brief PORT pin number */
#define BOARD_SPIFI_CLK_PIN_MASK (1U << 26U)                  /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_24 (coord M7), J13[6]/U27[5]/P0_24-SPIFI_IO0
  @{ */
/* Routed pin properties */
#define BOARD_SPIFI_IO0_PERIPHERAL SPIFI0                     /*!<@brief Peripheral name */
#define BOARD_SPIFI_IO0_SIGNAL SPIFI_IO0/SPIFI_MOSI           /*!<@brief Signal name */
#define BOARD_SPIFI_IO0_PIN_NAME SPIFI_IO(0)                  /*!<@brief Routed pin name */
#define BOARD_SPIFI_IO0_LABEL "J13[6]/U27[5]/P0_24-SPIFI_IO0" /*!<@brief Label */
#define BOARD_SPIFI_IO0_NAME "SPIFI_IO0"                      /*!<@brief Identifier */
#define BOARD_SPIFI_IO0_PORT 0U                               /*!<@brief PORT peripheral base pointer */
#define BOARD_SPIFI_IO0_PIN 24U                               /*!<@brief PORT pin number */
#define BOARD_SPIFI_IO0_PIN_MASK (1U << 24U)                  /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_25 (coord K8), J13[4]/U27[2]/P0_25-SPIFI_IO1
  @{ */
/* Routed pin properties */
#define BOARD_SPIFI_IO1_PERIPHERAL SPIFI0                     /*!<@brief Peripheral name */
#define BOARD_SPIFI_IO1_SIGNAL SPIFI_IO1/SPIFI_MISO           /*!<@brief Signal name */
#define BOARD_SPIFI_IO1_PIN_NAME SPIFI_IO(1)                  /*!<@brief Routed pin name */
#define BOARD_SPIFI_IO1_LABEL "J13[4]/U27[2]/P0_25-SPIFI_IO1" /*!<@brief Label */
#define BOARD_SPIFI_IO1_NAME "SPIFI_IO1"                      /*!<@brief Identifier */
#define BOARD_SPIFI_IO1_PORT 0U                               /*!<@brief PORT peripheral base pointer */
#define BOARD_SPIFI_IO1_PIN 25U                               /*!<@brief PORT pin number */
#define BOARD_SPIFI_IO1_PIN_MASK (1U << 25U)                  /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_27 (coord L9), J13[12]/U27[7]/P0_27-SPIFI_IO3
  @{ */
/* Routed pin properties */
#define BOARD_SPIFI_IO3_PERIPHERAL SPIFI0                      /*!<@brief Peripheral name */
#define BOARD_SPIFI_IO3_SIGNAL SPIFI_IO                        /*!<@brief Signal name */
#define BOARD_SPIFI_IO3_CHANNEL 3                              /*!<@brief Signal channel */
#define BOARD_SPIFI_IO3_PIN_NAME SPIFI_IO(3)                   /*!<@brief Routed pin name */
#define BOARD_SPIFI_IO3_LABEL "J13[12]/U27[7]/P0_27-SPIFI_IO3" /*!<@brief Label */
#define BOARD_SPIFI_IO3_NAME "SPIFI_IO3"                       /*!<@brief Identifier */
#define BOARD_SPIFI_IO3_PORT 0U                                /*!<@brief PORT peripheral base pointer */
#define BOARD_SPIFI_IO3_PIN 27U                                /*!<@brief PORT pin number */
#define BOARD_SPIFI_IO3_PIN_MASK (1U << 27U)                   /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO0_28 (coord M9), J13[10]/U27[3]/P0_28-SPIFI_IO2-USB0_OCURRn
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_SPIFI_IO2_PERIPHERAL SPIFI0
/*!
 * @brief Signal name */
#define BOARD_SPIFI_IO2_SIGNAL SPIFI_IO
/*!
 * @brief Signal channel */
#define BOARD_SPIFI_IO2_CHANNEL 2
/*!
 * @brief Routed pin name */
#define BOARD_SPIFI_IO2_PIN_NAME SPIFI_IO(2)
/*!
 * @brief Label */
#define BOARD_SPIFI_IO2_LABEL "J13[10]/U27[3]/P0_28-SPIFI_IO2-USB0_OCURRn"
/*!
 * @brief Identifier */
#define BOARD_SPIFI_IO2_NAME "SPIFI_IO2"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_SPIFI_IO2_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_SPIFI_IO2_PIN 28U
/*!
 * @brief PORT pin mask */
#define BOARD_SPIFI_IO2_PIN_MASK (1U << 28U)
/* @} */

