nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*! @name PIO0_23 (coord N7), J13[8]/U27[1]/P0_23-SPIFI_CSn-MCLK
  @{ */
/* Routed pin properties */
#define BOARD_SPIFI_CSn_PERIPHERAL SPIFI0                          /*!<@brief Peripheral name */
#define BOARD_SPIFI_CSn_SIGNAL SPIFI_CSN                           /*!<@brief Signal name */
#define BOARD_SPIFI_CSn_PIN_NAME SPIFI_CSN                         /*!<@brief Routed pin name */
#define BOARD_SPIFI_CSn_LABEL "J13[8]/U27[1]/P0_23-SPIFI_CSn-MCLK" /*!<@brief Label */
#define BOARD_SPIFI_CSn_NAME "SPIFI_CSn"                           /*!<@brief Identifier */
#define BOARD_SPIFI_CSn_PORT 0U                                    /*!<@brief PORT peripheral base pointer */
#define BOARD_SPIFI_CSn_PIN 23U                                    /*!<@brief PORT pin number */
#define BOARD_SPIFI_CSn_PIN_MASK (1U << 23U)                       /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO2_12 (coord M2), U26A1[3]/P2_12-SPIFI_RSTn
  @{ */
/* Routed pin properties */
#define BOARD_SPIFI_RSTn_PERIPHERAL GPIO                   /*!<@brief Peripheral name */
#define BOARD_SPIFI_RSTn_SIGNAL PIO2                       /*!<@brief Signal name */
#define BOARD_SPIFI_RSTn_CHANNEL 12                        /*!<@brief Signal channel */
#define BOARD_SPIFI_RSTn_PIN_NAME PIO2_12                  /*!<@brief Routed pin name */
#define BOARD_SPIFI_RSTn_LABEL "U26A1[3]/P2_12-SPIFI_RSTn" /*!<@brief Label */
#define BOARD_SPIFI_RSTn_NAME "SPIFI_RSTn"                 /*!<@brief Identifier */

/* Symbols to be used with GPIO driver */
#define BOARD_SPIFI_RSTn_GPIO GPIO                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_SPIFI_RSTn_GPIO_PIN 12U                      /*!<@brief GPIO pin number */
#define BOARD_SPIFI_RSTn_GPIO_PIN_MASK (1U << 12U)         /*!<@brief GPIO pin mask */
#define BOARD_SPIFI_RSTn_PORT 2U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_SPIFI_RSTn_PIN 12U                           /*!<@brief PORT pin number */
#define BOARD_SPIFI_RSTn_PIN_MASK (1U << 12U)              /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPI_FLASHPins(void); /* Function assigned for the Cortex-M4F */

#define PIO210_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO210_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO23_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO23_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO24_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO24_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO25_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO25_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO26_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO26_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO27_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO27_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO28_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO28_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO29_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO29_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO315_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO315_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */

/*! @name PIO3_15 (coord D2), RP1[1]/U9[8]/P3_15-SD_WPn
  @{ */
/* Routed pin properties */
#define BOARD_SD_WPn_PERIPHERAL SDIF                   /*!<@brief Peripheral name */
#define BOARD_SD_WPn_SIGNAL SD_WR_PRT                  /*!<@brief Signal name */
#define BOARD_SD_WPn_PIN_NAME SD_WR_PRT                /*!<@brief Routed pin name */
#define BOARD_SD_WPn_LABEL "RP1[1]/U9[8]/P3_15-SD_WPn" /*!<@brief Label */
#define BOARD_SD_WPn_NAME "SD_WPn"                     /*!<@brief Identifier */
#define BOARD_SD_WPn_PORT 3U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_WPn_PIN 15U                           /*!<@brief PORT pin number */
#define BOARD_SD_WPn_PIN_MASK (1U << 15U)              /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO2_10 (coord P1), RP1[2]/U9[7]/P2_10-SD_CDn
  @{ */
/* Routed pin properties */
#define BOARD_SD_CDn_PERIPHERAL SDIF                   /*!<@brief Peripheral name */
#define BOARD_SD_CDn_SIGNAL SD_CARD_DET                /*!<@brief Signal name */
#define BOARD_SD_CDn_PIN_NAME SD_CARD_DET_N            /*!<@brief Routed pin name */
#define BOARD_SD_CDn_LABEL "RP1[2]/U9[7]/P2_10-SD_CDn" /*!<@brief Label */
#define BOARD_SD_CDn_NAME "SD_CDn"                     /*!<@brief Identifier */
#define BOARD_SD_CDn_PORT 2U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_CDn_PIN 10U                           /*!<@brief PORT pin number */
#define BOARD_SD_CDn_PIN_MASK (1U << 10U)              /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO2_8 (coord F4), RP1[3]/U9[6]/P2_8-SD_D2
  @{ */
/* Routed pin properties */
#define BOARD_SD_D2_PERIPHERAL SDIF                 /*!<@brief Peripheral name */
#define BOARD_SD_D2_SIGNAL SD_D                     /*!<@brief Signal name */
#define BOARD_SD_D2_CHANNEL 2                       /*!<@brief Signal channel */
#define BOARD_SD_D2_PIN_NAME SD_D(2)                /*!<@brief Routed pin name */
#define BOARD_SD_D2_LABEL "RP1[3]/U9[6]/P2_8-SD_D2" /*!<@brief Label */
#define BOARD_SD_D2_NAME "SD_D2"                    /*!<@brief Identifier */
#define BOARD_SD_D2_PORT 2U                         /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_D2_PIN 8U                          /*!<@brief PORT pin number */
#define BOARD_SD_D2_PIN_MASK (1U << 8U)             /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO2_7 (coord J2), RP1[4]/U9[5]/P2_7-SD_D1
  @{ */
/* Routed pin properties */
#define BOARD_SD_D1_PERIPHERAL SDIF                 /*!<@brief Peripheral name */
#define BOARD_SD_D1_SIGNAL SD_D                     /*!<@brief Signal name */
#define BOARD_SD_D1_CHANNEL 1                       /*!<@brief Signal channel */
#define BOARD_SD_D1_PIN_NAME SD_D(1)                /*!<@brief Routed pin name */
#define BOARD_SD_D1_LABEL "RP1[4]/U9[5]/P2_7-SD_D1" /*!<@brief Label */
#define BOARD_SD_D1_NAME "SD_D1"                    /*!<@brief Identifier */
#define BOARD_SD_D1_PORT 2U                         /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_D1_PIN 7U                          /*!<@brief PORT pin number */
#define BOARD_SD_D1_PIN_MASK (1U << 7U)             /*!<@brief PORT pin mask */
                                                    /* @} */

