nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*! @name PIO2_6 (coord F3), RP1[5]/U9[4]/P2_6-SD_D0
  @{ */
/* Routed pin properties */
#define BOARD_SD_D0_PERIPHERAL SDIF                 /*!<@brief Peripheral name */
#define BOARD_SD_D0_SIGNAL SD_D                     /*!<@brief Signal name */
#define BOARD_SD_D0_CHANNEL 0                       /*!<@brief Signal channel */
#define BOARD_SD_D0_PIN_NAME SD_D(0)                /*!<@brief Routed pin name */
#define BOARD_SD_D0_LABEL "RP1[5]/U9[4]/P2_6-SD_D0" /*!<@brief Label */
#define BOARD_SD_D0_NAME "SD_D0"                    /*!<@brief Identifier */
#define BOARD_SD_D0_PORT 2U                         /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_D0_PIN 6U                          /*!<@brief PORT pin number */
#define BOARD_SD_D0_PIN_MASK (1U << 6U)             /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO2_3 (coord B1), U9[3]/P2_3-SD_CLK
  @{ */
/* Routed pin properties */
#define BOARD_SD_CLK_PERIPHERAL SDIF           /*!<@brief Peripheral name */
#define BOARD_SD_CLK_SIGNAL SD_CLK             /*!<@brief Signal name */
#define BOARD_SD_CLK_PIN_NAME SD_CLK           /*!<@brief Routed pin name */
#define BOARD_SD_CLK_LABEL "U9[3]/P2_3-SD_CLK" /*!<@brief Label */
#define BOARD_SD_CLK_NAME "SD_CLK"             /*!<@brief Identifier */
#define BOARD_SD_CLK_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_CLK_PIN 3U                    /*!<@brief PORT pin number */
#define BOARD_SD_CLK_PIN_MASK (1U << 3U)       /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO2_4 (coord D3), RP1[6]/U9[2]/P2_4-SD_CMD
  @{ */
/* Routed pin properties */
#define BOARD_SD_CMD_PERIPHERAL SDIF                  /*!<@brief Peripheral name */
#define BOARD_SD_CMD_SIGNAL SD_CMD                    /*!<@brief Signal name */
#define BOARD_SD_CMD_PIN_NAME SD_CMD                  /*!<@brief Routed pin name */
#define BOARD_SD_CMD_LABEL "RP1[6]/U9[2]/P2_4-SD_CMD" /*!<@brief Label */
#define BOARD_SD_CMD_NAME "SD_CMD"                    /*!<@brief Identifier */
#define BOARD_SD_CMD_PORT 2U                          /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_CMD_PIN 4U                           /*!<@brief PORT pin number */
#define BOARD_SD_CMD_PIN_MASK (1U << 4U)              /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO2_9 (coord K2), RP1[7]/U9[1]/P2_9-SD_D3
  @{ */
/* Routed pin properties */
#define BOARD_SD_D3_PERIPHERAL SDIF                 /*!<@brief Peripheral name */
#define BOARD_SD_D3_SIGNAL SD_D                     /*!<@brief Signal name */
#define BOARD_SD_D3_CHANNEL 3                       /*!<@brief Signal channel */
#define BOARD_SD_D3_PIN_NAME SD_D(3)                /*!<@brief Routed pin name */
#define BOARD_SD_D3_LABEL "RP1[7]/U9[1]/P2_9-SD_D3" /*!<@brief Label */
#define BOARD_SD_D3_NAME "SD_D3"                    /*!<@brief Identifier */
#define BOARD_SD_D3_PORT 2U                         /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_D3_PIN 9U                          /*!<@brief PORT pin number */
#define BOARD_SD_D3_PIN_MASK (1U << 9U)             /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO2_5 (coord C1), Q3[1]/P2_5-SD_POW_EN
  @{ */
/* Routed pin properties */
#define BOARD_SD_POW_EN_PERIPHERAL SDIF              /*!<@brief Peripheral name */
#define BOARD_SD_POW_EN_SIGNAL SD_POW_EN             /*!<@brief Signal name */
#define BOARD_SD_POW_EN_PIN_NAME SD_POW_EN           /*!<@brief Routed pin name */
#define BOARD_SD_POW_EN_LABEL "Q3[1]/P2_5-SD_POW_EN" /*!<@brief Label */
#define BOARD_SD_POW_EN_NAME "SD_POW_EN"             /*!<@brief Identifier */
#define BOARD_SD_POW_EN_PORT 2U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_POW_EN_PIN 5U                       /*!<@brief PORT pin number */
#define BOARD_SD_POW_EN_PIN_MASK (1U << 5U)          /*!<@brief PORT pin mask */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHCPins(void); /* Function assigned for the Cortex-M4F */

#define PIO015_ANAMODE_DISABLED 0x01u /*!<@brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO015_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO015_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO018_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO018_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO019_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO019_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO020_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO020_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO021_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO021_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO02_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO02_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO03_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO03_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO04_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO04_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO05_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO05_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO06_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO06_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO07_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO07_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO08_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO08_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO09_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO09_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO110_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO110_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO111_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO111_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO112_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO112_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO113_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO113_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO114_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO114_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO115_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO115_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO116_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO116_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO119_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO119_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO120_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO120_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO121_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO121_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO123_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO123_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO124_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO124_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO125_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO125_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO126_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO126_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO127_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO127_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO128_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO128_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO129_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO129_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO130_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO130_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO131_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO131_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO14_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO14_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO15_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO15_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO16_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO16_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO17_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO17_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO18_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO18_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO19_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO19_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO325_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO325_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */

/*! @name PIO3_25 (coord P9), U28[G8]/P3_25-EMC_A14
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A14_PERIPHERAL EMC                /*!<@brief Peripheral name */
#define BOARD_EMC_A14_SIGNAL EMC_A                  /*!<@brief Signal name */
#define BOARD_EMC_A14_CHANNEL 14                    /*!<@brief Signal channel */
#define BOARD_EMC_A14_PIN_NAME EMC_A(14)            /*!<@brief Routed pin name */
#define BOARD_EMC_A14_LABEL "U28[G8]/P3_25-EMC_A14" /*!<@brief Label */
#define BOARD_EMC_A14_NAME "EMC_A14"                /*!<@brief Identifier */
#define BOARD_EMC_A14_PORT 3U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A14_PIN 25U                       /*!<@brief PORT pin number */
#define BOARD_EMC_A14_PIN_MASK (1U << 25U)          /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO1_25 (coord M12), U28[G7]/P1_25-EMC_A13
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A13_PERIPHERAL EMC                /*!<@brief Peripheral name */
#define BOARD_EMC_A13_SIGNAL EMC_A                  /*!<@brief Signal name */
#define BOARD_EMC_A13_CHANNEL 13                    /*!<@brief Signal channel */
#define BOARD_EMC_A13_PIN_NAME EMC_A(13)            /*!<@brief Routed pin name */
#define BOARD_EMC_A13_LABEL "U28[G7]/P1_25-EMC_A13" /*!<@brief Label */
#define BOARD_EMC_A13_NAME "EMC_A13"                /*!<@brief Identifier */
#define BOARD_EMC_A13_PORT 1U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A13_PIN 25U                       /*!<@brief PORT pin number */
#define BOARD_EMC_A13_PIN_MASK (1U << 25U)          /*!<@brief PORT pin mask */
                                                    /* @} */

