nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*! @name PIO1_24 (coord N14), U28[G1]/P1_24-EMC_A12
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A12_PERIPHERAL EMC                /*!<@brief Peripheral name */
#define BOARD_EMC_A12_SIGNAL EMC_A                  /*!<@brief Signal name */
#define BOARD_EMC_A12_CHANNEL 12                    /*!<@brief Signal channel */
#define BOARD_EMC_A12_PIN_NAME EMC_A(12)            /*!<@brief Routed pin name */
#define BOARD_EMC_A12_LABEL "U28[G1]/P1_24-EMC_A12" /*!<@brief Label */
#define BOARD_EMC_A12_NAME "EMC_A12"                /*!<@brief Identifier */
#define BOARD_EMC_A12_PORT 1U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A12_PIN 24U                       /*!<@brief PORT pin number */
#define BOARD_EMC_A12_PIN_MASK (1U << 24U)          /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO1_23 (coord M10), U28[G2]/P1_23-EMC_A11
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A11_PERIPHERAL EMC                /*!<@brief Peripheral name */
#define BOARD_EMC_A11_SIGNAL EMC_A                  /*!<@brief Signal name */
#define BOARD_EMC_A11_CHANNEL 11                    /*!<@brief Signal channel */
#define BOARD_EMC_A11_PIN_NAME EMC_A(11)            /*!<@brief Routed pin name */
#define BOARD_EMC_A11_LABEL "U28[G2]/P1_23-EMC_A11" /*!<@brief Label */
#define BOARD_EMC_A11_NAME "EMC_A11"                /*!<@brief Identifier */
#define BOARD_EMC_A11_PORT 1U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A11_PIN 23U                       /*!<@brief PORT pin number */
#define BOARD_EMC_A11_PIN_MASK (1U << 23U)          /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO1_16 (coord B7), U28[H9]/P1_16-EMC_A10
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A10_PERIPHERAL EMC                /*!<@brief Peripheral name */
#define BOARD_EMC_A10_SIGNAL EMC_A                  /*!<@brief Signal name */
#define BOARD_EMC_A10_CHANNEL 10                    /*!<@brief Signal channel */
#define BOARD_EMC_A10_PIN_NAME EMC_A(10)            /*!<@brief Routed pin name */
#define BOARD_EMC_A10_LABEL "U28[H9]/P1_16-EMC_A10" /*!<@brief Label */
#define BOARD_EMC_A10_NAME "EMC_A10"                /*!<@brief Identifier */
#define BOARD_EMC_A10_PORT 1U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A10_PIN 16U                       /*!<@brief PORT pin number */
#define BOARD_EMC_A10_PIN_MASK (1U << 16U)          /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO1_27 (coord F10), U28[G3]/P1_27-EMC_A9
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A9_PERIPHERAL EMC               /*!<@brief Peripheral name */
#define BOARD_EMC_A9_SIGNAL EMC_A                 /*!<@brief Signal name */
#define BOARD_EMC_A9_CHANNEL 9                    /*!<@brief Signal channel */
#define BOARD_EMC_A9_PIN_NAME EMC_A(9)            /*!<@brief Routed pin name */
#define BOARD_EMC_A9_LABEL "U28[G3]/P1_27-EMC_A9" /*!<@brief Label */
#define BOARD_EMC_A9_NAME "EMC_A9"                /*!<@brief Identifier */
#define BOARD_EMC_A9_PORT 1U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A9_PIN 27U                      /*!<@brief PORT pin number */
#define BOARD_EMC_A9_PIN_MASK (1U << 27U)         /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO1_26 (coord J10), U28[H1]/P1_26-EMC_A8
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A8_PERIPHERAL EMC               /*!<@brief Peripheral name */
#define BOARD_EMC_A8_SIGNAL EMC_A                 /*!<@brief Signal name */
#define BOARD_EMC_A8_CHANNEL 8                    /*!<@brief Signal channel */
#define BOARD_EMC_A8_PIN_NAME EMC_A(8)            /*!<@brief Routed pin name */
#define BOARD_EMC_A8_LABEL "U28[H1]/P1_26-EMC_A8" /*!<@brief Label */
#define BOARD_EMC_A8_NAME "EMC_A8"                /*!<@brief Identifier */
#define BOARD_EMC_A8_PORT 1U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A8_PIN 26U                      /*!<@brief PORT pin number */
#define BOARD_EMC_A8_PIN_MASK (1U << 26U)         /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO1_8 (coord P8), U28[H2]/P1_8-EMC_A7
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A7_PERIPHERAL EMC              /*!<@brief Peripheral name */
#define BOARD_EMC_A7_SIGNAL EMC_A                /*!<@brief Signal name */
#define BOARD_EMC_A7_CHANNEL 7                   /*!<@brief Signal channel */
#define BOARD_EMC_A7_PIN_NAME EMC_A(7)           /*!<@brief Routed pin name */
#define BOARD_EMC_A7_LABEL "U28[H2]/P1_8-EMC_A7" /*!<@brief Label */
#define BOARD_EMC_A7_NAME "EMC_A7"               /*!<@brief Identifier */
#define BOARD_EMC_A7_PORT 1U                     /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A7_PIN 8U                      /*!<@brief PORT pin number */
#define BOARD_EMC_A7_PIN_MASK (1U << 8U)         /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO1_7 (coord N1), U28[H3]/P1_7-EMC_A6
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A6_PERIPHERAL EMC              /*!<@brief Peripheral name */
#define BOARD_EMC_A6_SIGNAL EMC_A                /*!<@brief Signal name */
#define BOARD_EMC_A6_CHANNEL 6                   /*!<@brief Signal channel */
#define BOARD_EMC_A6_PIN_NAME EMC_A(6)           /*!<@brief Routed pin name */
#define BOARD_EMC_A6_LABEL "U28[H3]/P1_7-EMC_A6" /*!<@brief Label */
#define BOARD_EMC_A6_NAME "EMC_A6"               /*!<@brief Identifier */
#define BOARD_EMC_A6_PORT 1U                     /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A6_PIN 7U                      /*!<@brief PORT pin number */
#define BOARD_EMC_A6_PIN_MASK (1U << 7U)         /*!<@brief PORT pin mask */
                                                 /* @} */

