nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*! @name PIO1_6 (coord G4), U28[J2]/P1_6-EMC_A5
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A5_PERIPHERAL EMC              /*!<@brief Peripheral name */
#define BOARD_EMC_A5_SIGNAL EMC_A                /*!<@brief Signal name */
#define BOARD_EMC_A5_CHANNEL 5                   /*!<@brief Signal channel */
#define BOARD_EMC_A5_PIN_NAME EMC_A(5)           /*!<@brief Routed pin name */
#define BOARD_EMC_A5_LABEL "U28[J2]/P1_6-EMC_A5" /*!<@brief Label */
#define BOARD_EMC_A5_NAME "EMC_A5"               /*!<@brief Identifier */
#define BOARD_EMC_A5_PORT 1U                     /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A5_PIN 6U                      /*!<@brief PORT pin number */
#define BOARD_EMC_A5_PIN_MASK (1U << 6U)         /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO1_5 (coord E4), U28[J3]/P1_5-EMC_A4
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A4_PERIPHERAL EMC              /*!<@brief Peripheral name */
#define BOARD_EMC_A4_SIGNAL EMC_A                /*!<@brief Signal name */
#define BOARD_EMC_A4_CHANNEL 4                   /*!<@brief Signal channel */
#define BOARD_EMC_A4_PIN_NAME EMC_A(4)           /*!<@brief Routed pin name */
#define BOARD_EMC_A4_LABEL "U28[J3]/P1_5-EMC_A4" /*!<@brief Label */
#define BOARD_EMC_A4_NAME "EMC_A4"               /*!<@brief Identifier */
#define BOARD_EMC_A4_PORT 1U                     /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A4_PIN 5U                      /*!<@brief PORT pin number */
#define BOARD_EMC_A4_PIN_MASK (1U << 5U)         /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO0_21 (coord C13), U28[J7]/P0_21-EMC_A3
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A3_PERIPHERAL EMC               /*!<@brief Peripheral name */
#define BOARD_EMC_A3_SIGNAL EMC_A                 /*!<@brief Signal name */
#define BOARD_EMC_A3_CHANNEL 3                    /*!<@brief Signal channel */
#define BOARD_EMC_A3_PIN_NAME EMC_A(3)            /*!<@brief Routed pin name */
#define BOARD_EMC_A3_LABEL "U28[J7]/P0_21-EMC_A3" /*!<@brief Label */
#define BOARD_EMC_A3_NAME "EMC_A3"                /*!<@brief Identifier */
#define BOARD_EMC_A3_PORT 0U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A3_PIN 21U                      /*!<@brief PORT pin number */
#define BOARD_EMC_A3_PIN_MASK (1U << 21U)         /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO0_20 (coord D13), U28[J8]/P0_20-EMC_A2
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A2_PERIPHERAL EMC               /*!<@brief Peripheral name */
#define BOARD_EMC_A2_SIGNAL EMC_A                 /*!<@brief Signal name */
#define BOARD_EMC_A2_CHANNEL 2                    /*!<@brief Signal channel */
#define BOARD_EMC_A2_PIN_NAME EMC_A(2)            /*!<@brief Routed pin name */
#define BOARD_EMC_A2_LABEL "U28[J8]/P0_20-EMC_A2" /*!<@brief Label */
#define BOARD_EMC_A2_NAME "EMC_A2"                /*!<@brief Identifier */
#define BOARD_EMC_A2_PORT 0U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A2_PIN 20U                      /*!<@brief PORT pin number */
#define BOARD_EMC_A2_PIN_MASK (1U << 20U)         /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO0_19 (coord C6), U28[H8]/P0_19-EMC_A1
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A1_PERIPHERAL EMC               /*!<@brief Peripheral name */
#define BOARD_EMC_A1_SIGNAL EMC_A                 /*!<@brief Signal name */
#define BOARD_EMC_A1_CHANNEL 1                    /*!<@brief Signal channel */
#define BOARD_EMC_A1_PIN_NAME EMC_A(1)            /*!<@brief Routed pin name */
#define BOARD_EMC_A1_LABEL "U28[H8]/P0_19-EMC_A1" /*!<@brief Label */
#define BOARD_EMC_A1_NAME "EMC_A1"                /*!<@brief Identifier */
#define BOARD_EMC_A1_PORT 0U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A1_PIN 19U                      /*!<@brief PORT pin number */
#define BOARD_EMC_A1_PIN_MASK (1U << 19U)         /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO0_18 (coord C14), U28[H7]/P0_18-EMC_A0
  @{ */
/* Routed pin properties */
#define BOARD_EMC_A0_PERIPHERAL EMC               /*!<@brief Peripheral name */
#define BOARD_EMC_A0_SIGNAL EMC_A                 /*!<@brief Signal name */
#define BOARD_EMC_A0_CHANNEL 0                    /*!<@brief Signal channel */
#define BOARD_EMC_A0_PIN_NAME EMC_A(0)            /*!<@brief Routed pin name */
#define BOARD_EMC_A0_LABEL "U28[H7]/P0_18-EMC_A0" /*!<@brief Label */
#define BOARD_EMC_A0_NAME "EMC_A0"                /*!<@brief Identifier */
#define BOARD_EMC_A0_PORT 0U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A0_PIN 18U                      /*!<@brief PORT pin number */
#define BOARD_EMC_A0_PIN_MASK (1U << 18U)         /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO0_15 (coord L4), U28[F9]/P0_15-EMC_WEn
  @{ */
/* Routed pin properties */
#define BOARD_EMC_WEn_PERIPHERAL EMC                /*!<@brief Peripheral name */
#define BOARD_EMC_WEn_SIGNAL EMC_WE                 /*!<@brief Signal name */
#define BOARD_EMC_WEn_PIN_NAME EMC_WEN              /*!<@brief Routed pin name */
#define BOARD_EMC_WEn_LABEL "U28[F9]/P0_15-EMC_WEn" /*!<@brief Label */
#define BOARD_EMC_WEn_NAME "EMC_WEn"                /*!<@brief Identifier */
#define BOARD_EMC_WEn_PORT 0U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_WEn_PIN 15U                       /*!<@brief PORT pin number */
#define BOARD_EMC_WEn_PIN_MASK (1U << 15U)          /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO1_9 (coord K6), U28[F7]/P1_9-EMC_CASn
  @{ */
/* Routed pin properties */
#define BOARD_EMC_CASn_PERIPHERAL EMC                /*!<@brief Peripheral name */
#define BOARD_EMC_CASn_SIGNAL EMC_CAS                /*!<@brief Signal name */
#define BOARD_EMC_CASn_PIN_NAME EMC_CASN             /*!<@brief Routed pin name */
#define BOARD_EMC_CASn_LABEL "U28[F7]/P1_9-EMC_CASn" /*!<@brief Label */
#define BOARD_EMC_CASn_NAME "EMC_CASn"               /*!<@brief Identifier */
#define BOARD_EMC_CASn_PORT 1U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_CASn_PIN 9U                        /*!<@brief PORT pin number */
#define BOARD_EMC_CASn_PIN_MASK (1U << 9U)           /*!<@brief PORT pin mask */
                                                     /* @} */

