nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*! @name PIO1_10 (coord N9), U28[F8]/P1_10-EMC_RASn
  @{ */
/* Routed pin properties */
#define BOARD_EMC_RASn_PERIPHERAL EMC                 /*!<@brief Peripheral name */
#define BOARD_EMC_RASn_SIGNAL EMC_RAS                 /*!<@brief Signal name */
#define BOARD_EMC_RASn_PIN_NAME EMC_RASN              /*!<@brief Routed pin name */
#define BOARD_EMC_RASn_LABEL "U28[F8]/P1_10-EMC_RASn" /*!<@brief Label */
#define BOARD_EMC_RASn_NAME "EMC_RASn"                /*!<@brief Identifier */
#define BOARD_EMC_RASn_PORT 1U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_RASn_PIN 10U                        /*!<@brief PORT pin number */
#define BOARD_EMC_RASn_PIN_MASK (1U << 10U)           /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO1_12 (coord K9), U28[G9]/P1_12-EMC_DYCSn0
  @{ */
/* Routed pin properties */
#define BOARD_EMC_DYCSn0_PERIPHERAL EMC                   /*!<@brief Peripheral name */
#define BOARD_EMC_DYCSn0_SIGNAL EMC_DYCS                  /*!<@brief Signal name */
#define BOARD_EMC_DYCSn0_CHANNEL 0                        /*!<@brief Signal channel */
#define BOARD_EMC_DYCSn0_PIN_NAME EMC_DYCSN(0)            /*!<@brief Routed pin name */
#define BOARD_EMC_DYCSn0_LABEL "U28[G9]/P1_12-EMC_DYCSn0" /*!<@brief Label */
#define BOARD_EMC_DYCSn0_NAME "EMC_DYCSn0"                /*!<@brief Identifier */
#define BOARD_EMC_DYCSn0_PORT 1U                          /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_DYCSn0_PIN 12U                          /*!<@brief PORT pin number */
#define BOARD_EMC_DYCSn0_PIN_MASK (1U << 12U)             /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_31 (coord C5), U28[A2]/RP2[1]/P1_31-EMC_D15
  @{ */
/* Routed pin properties */
#define BOARD_EMC_D15_PERIPHERAL EMC                       /*!<@brief Peripheral name */
#define BOARD_EMC_D15_SIGNAL EMC_D                         /*!<@brief Signal name */
#define BOARD_EMC_D15_CHANNEL 15                           /*!<@brief Signal channel */
#define BOARD_EMC_D15_PIN_NAME EMC_D(15)                   /*!<@brief Routed pin name */
#define BOARD_EMC_D15_LABEL "U28[A2]/RP2[1]/P1_31-EMC_D15" /*!<@brief Label */
#define BOARD_EMC_D15_NAME "EMC_D15"                       /*!<@brief Identifier */
#define BOARD_EMC_D15_PORT 1U                              /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D15_PIN 31U                              /*!<@brief PORT pin number */
#define BOARD_EMC_D15_PIN_MASK (1U << 31U)                 /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_30 (coord A8), U28[B1]/RP2[2]/P1_30-EMC_D14
  @{ */
/* Routed pin properties */
#define BOARD_EMC_D14_PERIPHERAL EMC                       /*!<@brief Peripheral name */
#define BOARD_EMC_D14_SIGNAL EMC_D                         /*!<@brief Signal name */
#define BOARD_EMC_D14_CHANNEL 14                           /*!<@brief Signal channel */
#define BOARD_EMC_D14_PIN_NAME EMC_D(14)                   /*!<@brief Routed pin name */
#define BOARD_EMC_D14_LABEL "U28[B1]/RP2[2]/P1_30-EMC_D14" /*!<@brief Label */
#define BOARD_EMC_D14_NAME "EMC_D14"                       /*!<@brief Identifier */
#define BOARD_EMC_D14_PORT 1U                              /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D14_PIN 30U                              /*!<@brief PORT pin number */
#define BOARD_EMC_D14_PIN_MASK (1U << 30U)                 /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_29 (coord C11), U28[B2]/RP2[3]/P1_29-EMC_D13
  @{ */
/* Routed pin properties */
#define BOARD_EMC_D13_PERIPHERAL EMC                       /*!<@brief Peripheral name */
#define BOARD_EMC_D13_SIGNAL EMC_D                         /*!<@brief Signal name */
#define BOARD_EMC_D13_CHANNEL 13                           /*!<@brief Signal channel */
#define BOARD_EMC_D13_PIN_NAME EMC_D(13)                   /*!<@brief Routed pin name */
#define BOARD_EMC_D13_LABEL "U28[B2]/RP2[3]/P1_29-EMC_D13" /*!<@brief Label */
#define BOARD_EMC_D13_NAME "EMC_D13"                       /*!<@brief Identifier */
#define BOARD_EMC_D13_PORT 1U                              /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D13_PIN 29U                              /*!<@brief PORT pin number */
#define BOARD_EMC_D13_PIN_MASK (1U << 29U)                 /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_28 (coord E12), U28[C1]/RP2[4]/P1_28-EMC_D12
  @{ */
/* Routed pin properties */
#define BOARD_EMC_D12_PERIPHERAL EMC                       /*!<@brief Peripheral name */
#define BOARD_EMC_D12_SIGNAL EMC_D                         /*!<@brief Signal name */
#define BOARD_EMC_D12_CHANNEL 12                           /*!<@brief Signal channel */
#define BOARD_EMC_D12_PIN_NAME EMC_D(12)                   /*!<@brief Routed pin name */
#define BOARD_EMC_D12_LABEL "U28[C1]/RP2[4]/P1_28-EMC_D12" /*!<@brief Label */
#define BOARD_EMC_D12_NAME "EMC_D12"                       /*!<@brief Identifier */
#define BOARD_EMC_D12_PORT 1U                              /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D12_PIN 28U                              /*!<@brief PORT pin number */
#define BOARD_EMC_D12_PIN_MASK (1U << 28U)                 /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_4 (coord D4), U28[C2]/RP4[1]/P1_4-EMC_D11
  @{ */
/* Routed pin properties */
#define BOARD_EMC_D11_PERIPHERAL EMC                      /*!<@brief Peripheral name */
#define BOARD_EMC_D11_SIGNAL EMC_D                        /*!<@brief Signal name */
#define BOARD_EMC_D11_CHANNEL 11                          /*!<@brief Signal channel */
#define BOARD_EMC_D11_PIN_NAME EMC_D(11)                  /*!<@brief Routed pin name */
#define BOARD_EMC_D11_LABEL "U28[C2]/RP4[1]/P1_4-EMC_D11" /*!<@brief Label */
#define BOARD_EMC_D11_NAME "EMC_D11"                      /*!<@brief Identifier */
#define BOARD_EMC_D11_PORT 1U                             /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D11_PIN 4U                              /*!<@brief PORT pin number */
#define BOARD_EMC_D11_PIN_MASK (1U << 4U)                 /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_21 (coord N8), U28[D1]/RP4[2]/P1_21-EMC_D10
  @{ */
/* Routed pin properties */
#define BOARD_EMC_D10_PERIPHERAL EMC                       /*!<@brief Peripheral name */
#define BOARD_EMC_D10_SIGNAL EMC_D                         /*!<@brief Signal name */
#define BOARD_EMC_D10_CHANNEL 10                           /*!<@brief Signal channel */
#define BOARD_EMC_D10_PIN_NAME EMC_D(10)                   /*!<@brief Routed pin name */
#define BOARD_EMC_D10_LABEL "U28[D1]/RP4[2]/P1_21-EMC_D10" /*!<@brief Label */
#define BOARD_EMC_D10_NAME "EMC_D10"                       /*!<@brief Identifier */
#define BOARD_EMC_D10_PORT 1U                              /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D10_PIN 21U                              /*!<@brief PORT pin number */
#define BOARD_EMC_D10_PIN_MASK (1U << 21U)                 /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_20 (coord M1), U28[D2]/RP4[3]/P1_20-EMC_D9
  @{ */
/* Routed pin properties */
#define BOARD_EMC_D9_PERIPHERAL EMC                      /*!<@brief Peripheral name */
#define BOARD_EMC_D9_SIGNAL EMC_D                        /*!<@brief Signal name */
#define BOARD_EMC_D9_CHANNEL 9                           /*!<@brief Signal channel */
#define BOARD_EMC_D9_PIN_NAME EMC_D(9)                   /*!<@brief Routed pin name */
#define BOARD_EMC_D9_LABEL "U28[D2]/RP4[3]/P1_20-EMC_D9" /*!<@brief Label */
#define BOARD_EMC_D9_NAME "EMC_D9"                       /*!<@brief Identifier */
#define BOARD_EMC_D9_PORT 1U                             /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D9_PIN 20U                             /*!<@brief PORT pin number */
#define BOARD_EMC_D9_PIN_MASK (1U << 20U)                /*!<@brief PORT pin mask */
                                                         /* @} */

