nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*! @name PIO1_19 (coord L1), U28[E1]/RP4[4]/P1_19-EMC_D8
  @{ */
/* Routed pin properties */
#define BOARD_EMC_D8_PERIPHERAL EMC                      /*!<@brief Peripheral name */
#define BOARD_EMC_D8_SIGNAL EMC_D                        /*!<@brief Signal name */
#define BOARD_EMC_D8_CHANNEL 8                           /*!<@brief Signal channel */
#define BOARD_EMC_D8_PIN_NAME EMC_D(8)                   /*!<@brief Routed pin name */
#define BOARD_EMC_D8_LABEL "U28[E1]/RP4[4]/P1_19-EMC_D8" /*!<@brief Label */
#define BOARD_EMC_D8_NAME "EMC_D8"                       /*!<@brief Identifier */
#define BOARD_EMC_D8_PORT 1U                             /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D8_PIN 19U                             /*!<@brief PORT pin number */
#define BOARD_EMC_D8_PIN_MASK (1U << 19U)                /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_9 (coord G12), U28[E9]/RP5[1]/P0_9-EMC_D7
  @{ */
/* Routed pin properties */
#define BOARD_EMC_D7_PERIPHERAL EMC                     /*!<@brief Peripheral name */
#define BOARD_EMC_D7_SIGNAL EMC_D                       /*!<@brief Signal name */
#define BOARD_EMC_D7_CHANNEL 7                          /*!<@brief Signal channel */
#define BOARD_EMC_D7_PIN_NAME EMC_D(7)                  /*!<@brief Routed pin name */
#define BOARD_EMC_D7_LABEL "U28[E9]/RP5[1]/P0_9-EMC_D7" /*!<@brief Label */
#define BOARD_EMC_D7_NAME "EMC_D7"                      /*!<@brief Identifier */
#define BOARD_EMC_D7_PORT 0U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D7_PIN 9U                             /*!<@brief PORT pin number */
#define BOARD_EMC_D7_PIN_MASK (1U << 9U)                /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_8 (coord H10), U28[D8]/RP5[2]/P0_8-EMC_D6
  @{ */
/* Routed pin properties */
#define BOARD_EMC_D6_PERIPHERAL EMC                     /*!<@brief Peripheral name */
#define BOARD_EMC_D6_SIGNAL EMC_D                       /*!<@brief Signal name */
#define BOARD_EMC_D6_CHANNEL 6                          /*!<@brief Signal channel */
#define BOARD_EMC_D6_PIN_NAME EMC_D(6)                  /*!<@brief Routed pin name */
#define BOARD_EMC_D6_LABEL "U28[D8]/RP5[2]/P0_8-EMC_D6" /*!<@brief Label */
#define BOARD_EMC_D6_NAME "EMC_D6"                      /*!<@brief Identifier */
#define BOARD_EMC_D6_PORT 0U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D6_PIN 8U                             /*!<@brief PORT pin number */
#define BOARD_EMC_D6_PIN_MASK (1U << 8U)                /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_7 (coord H12), U28[D9]/RP5[3]/P0_7-EMC_D5
  @{ */
/* Routed pin properties */
#define BOARD_EMC_D5_PERIPHERAL EMC                     /*!<@brief Peripheral name */
#define BOARD_EMC_D5_SIGNAL EMC_D                       /*!<@brief Signal name */
#define BOARD_EMC_D5_CHANNEL 5                          /*!<@brief Signal channel */
#define BOARD_EMC_D5_PIN_NAME EMC_D(5)                  /*!<@brief Routed pin name */
#define BOARD_EMC_D5_LABEL "U28[D9]/RP5[3]/P0_7-EMC_D5" /*!<@brief Label */
#define BOARD_EMC_D5_NAME "EMC_D5"                      /*!<@brief Identifier */
#define BOARD_EMC_D5_PORT 0U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D5_PIN 7U                             /*!<@brief PORT pin number */
#define BOARD_EMC_D5_PIN_MASK (1U << 7U)                /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_6 (coord A5), U28[C8]/RP5[4]/SW2/P0_6-ISP2/P0_6-EMC_D4
  @{ */
/* Routed pin properties */
#define BOARD_EMC_D4_PERIPHERAL EMC                                   /*!<@brief Peripheral name */
#define BOARD_EMC_D4_SIGNAL EMC_D                                     /*!<@brief Signal name */
#define BOARD_EMC_D4_CHANNEL 4                                        /*!<@brief Signal channel */
#define BOARD_EMC_D4_PIN_NAME EMC_D(4)                                /*!<@brief Routed pin name */
#define BOARD_EMC_D4_LABEL "U28[C8]/RP5[4]/SW2/P0_6-ISP2/P0_6-EMC_D4" /*!<@brief Label */
#define BOARD_EMC_D4_NAME "EMC_D4"                                    /*!<@brief Identifier */
#define BOARD_EMC_D4_PORT 0U                                          /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D4_PIN 6U                                           /*!<@brief PORT pin number */
#define BOARD_EMC_D4_PIN_MASK (1U << 6U)                              /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO0_5 (coord E7), U28[C9]/RP3[1]/JS32[1]/SW3/P0_5-ISP1/P0_5-EMC_D3
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_EMC_D3_PERIPHERAL EMC
/*!
 * @brief Signal name */
#define BOARD_EMC_D3_SIGNAL EMC_D
/*!
 * @brief Signal channel */
#define BOARD_EMC_D3_CHANNEL 3
/*!
 * @brief Routed pin name */
#define BOARD_EMC_D3_PIN_NAME EMC_D(3)
/*!
 * @brief Label */
#define BOARD_EMC_D3_LABEL "U28[C9]/RP3[1]/JS32[1]/SW3/P0_5-ISP1/P0_5-EMC_D3"
/*!
 * @brief Identifier */
#define BOARD_EMC_D3_NAME "EMC_D3"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_EMC_D3_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_EMC_D3_PIN 5U
/*!
 * @brief PORT pin mask */
#define BOARD_EMC_D3_PIN_MASK (1U << 5U)
/* @} */

/*! @name PIO0_4 (coord C8), U28[B8]/RP3[2]/JS32[3]/SW4/P0_4-ISP0/P0_4-EMC_D2
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_EMC_D2_PERIPHERAL EMC
/*!
 * @brief Signal name */
#define BOARD_EMC_D2_SIGNAL EMC_D
/*!
 * @brief Signal channel */
#define BOARD_EMC_D2_CHANNEL 2
/*!
 * @brief Routed pin name */
#define BOARD_EMC_D2_PIN_NAME EMC_D(2)
/*!
 * @brief Label */
#define BOARD_EMC_D2_LABEL "U28[B8]/RP3[2]/JS32[3]/SW4/P0_4-ISP0/P0_4-EMC_D2"
/*!
 * @brief Identifier */
#define BOARD_EMC_D2_NAME "EMC_D2"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_EMC_D2_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_EMC_D2_PIN 4U
/*!
 * @brief PORT pin mask */
#define BOARD_EMC_D2_PIN_MASK (1U << 4U)
/* @} */

/*! @name PIO0_3 (coord A10), U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_EMC_D1_PERIPHERAL EMC
/*!
 * @brief Signal name */
#define BOARD_EMC_D1_SIGNAL EMC_D
/*!
 * @brief Signal channel */
#define BOARD_EMC_D1_CHANNEL 1
/*!
 * @brief Routed pin name */
#define BOARD_EMC_D1_PIN_NAME EMC_D(1)
/*!
 * @brief Label */
#define BOARD_EMC_D1_LABEL "U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1"
/*!
 * @brief Identifier */
#define BOARD_EMC_D1_NAME "EMC_D1"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_EMC_D1_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_EMC_D1_PIN 3U
/*!
 * @brief PORT pin mask */
#define BOARD_EMC_D1_PIN_MASK (1U << 3U)
/* @} */

