nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*! @name PIO0_2 (coord E9), U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_EMC_D0_PERIPHERAL EMC
/*!
 * @brief Signal name */
#define BOARD_EMC_D0_SIGNAL EMC_D
/*!
 * @brief Signal channel */
#define BOARD_EMC_D0_CHANNEL 0
/*!
 * @brief Routed pin name */
#define BOARD_EMC_D0_PIN_NAME EMC_D(0)
/*!
 * @brief Label */
#define BOARD_EMC_D0_LABEL "U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0"
/*!
 * @brief Identifier */
#define BOARD_EMC_D0_NAME "EMC_D0"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_EMC_D0_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_EMC_D0_PIN 2U
/*!
 * @brief PORT pin mask */
#define BOARD_EMC_D0_PIN_MASK (1U << 2U)
/* @} */

/*! @name PIO1_14 (coord C12), U28[F1]/P1_14-EMC_DQM1
  @{ */
/* Routed pin properties */
#define BOARD_EMC_DQM1_PERIPHERAL EMC                 /*!<@brief Peripheral name */
#define BOARD_EMC_DQM1_SIGNAL EMC_DQM                 /*!<@brief Signal name */
#define BOARD_EMC_DQM1_CHANNEL 1                      /*!<@brief Signal channel */
#define BOARD_EMC_DQM1_PIN_NAME EMC_DQM(1)            /*!<@brief Routed pin name */
#define BOARD_EMC_DQM1_LABEL "U28[F1]/P1_14-EMC_DQM1" /*!<@brief Label */
#define BOARD_EMC_DQM1_NAME "EMC_DQM1"                /*!<@brief Identifier */
#define BOARD_EMC_DQM1_PORT 1U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_DQM1_PIN 14U                        /*!<@brief PORT pin number */
#define BOARD_EMC_DQM1_PIN_MASK (1U << 14U)           /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO1_13 (coord G10), U28[E8]/P1_13-EMC_DQM0
  @{ */
/* Routed pin properties */
#define BOARD_EMC_DQM0_PERIPHERAL EMC                 /*!<@brief Peripheral name */
#define BOARD_EMC_DQM0_SIGNAL EMC_DQM                 /*!<@brief Signal name */
#define BOARD_EMC_DQM0_CHANNEL 0                      /*!<@brief Signal channel */
#define BOARD_EMC_DQM0_PIN_NAME EMC_DQM(0)            /*!<@brief Routed pin name */
#define BOARD_EMC_DQM0_LABEL "U28[E8]/P1_13-EMC_DQM0" /*!<@brief Label */
#define BOARD_EMC_DQM0_NAME "EMC_DQM0"                /*!<@brief Identifier */
#define BOARD_EMC_DQM0_PORT 1U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_DQM0_PIN 13U                        /*!<@brief PORT pin number */
#define BOARD_EMC_DQM0_PIN_MASK (1U << 13U)           /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO1_11 (coord B4), U28[F2]/P1_11-EMC_CLK0
  @{ */
/* Routed pin properties */
#define BOARD_EMC_CLK0_PERIPHERAL EMC                 /*!<@brief Peripheral name */
#define BOARD_EMC_CLK0_SIGNAL EMC_CLK                 /*!<@brief Signal name */
#define BOARD_EMC_CLK0_CHANNEL 0                      /*!<@brief Signal channel */
#define BOARD_EMC_CLK0_PIN_NAME EMC_CLK(0)            /*!<@brief Routed pin name */
#define BOARD_EMC_CLK0_LABEL "U28[F2]/P1_11-EMC_CLK0" /*!<@brief Label */
#define BOARD_EMC_CLK0_NAME "EMC_CLK0"                /*!<@brief Identifier */
#define BOARD_EMC_CLK0_PORT 1U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_CLK0_PIN 11U                        /*!<@brief PORT pin number */
#define BOARD_EMC_CLK0_PIN_MASK (1U << 11U)           /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO1_15 (coord A11), U28[F3]/P1_15-EMC_CKE0
  @{ */
/* Routed pin properties */
#define BOARD_EMC_CKE0_PERIPHERAL EMC                 /*!<@brief Peripheral name */
#define BOARD_EMC_CKE0_SIGNAL EMC_CKE                 /*!<@brief Signal name */
#define BOARD_EMC_CKE0_CHANNEL 0                      /*!<@brief Signal channel */
#define BOARD_EMC_CKE0_PIN_NAME EMC_CKE(0)            /*!<@brief Routed pin name */
#define BOARD_EMC_CKE0_LABEL "U28[F3]/P1_15-EMC_CKE0" /*!<@brief Label */
#define BOARD_EMC_CKE0_NAME "EMC_CKE0"                /*!<@brief Identifier */
#define BOARD_EMC_CKE0_PORT 1U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_CKE0_PIN 15U                        /*!<@brief PORT pin number */
#define BOARD_EMC_CKE0_PIN_MASK (1U << 15U)           /*!<@brief PORT pin mask */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAMPins(void); /* Function assigned for the Cortex-M4F */

#define PIO029_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO029_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO030_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO030_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */

/*! @name PIO0_29 (coord B13), U24[13]/P0_29-ISP_FC0_RXD
  @{ */
/* Routed pin properties */
#define BOARD_ISP_FC0_RXD_PERIPHERAL FLEXCOMM0              /*!<@brief Peripheral name */
#define BOARD_ISP_FC0_RXD_SIGNAL RXD_SDA_MOSI               /*!<@brief Signal name */
#define BOARD_ISP_FC0_RXD_PIN_NAME FC0_RXD_SDA_MOSI         /*!<@brief Routed pin name */
#define BOARD_ISP_FC0_RXD_LABEL "U24[13]/P0_29-ISP_FC0_RXD" /*!<@brief Label */
#define BOARD_ISP_FC0_RXD_NAME "ISP_FC0_RXD"                /*!<@brief Identifier */
#define BOARD_ISP_FC0_RXD_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
#define BOARD_ISP_FC0_RXD_PORT 0U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC0_RXD_PIN 29U                           /*!<@brief PORT pin number */
#define BOARD_ISP_FC0_RXD_PIN_MASK (1U << 29U)              /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO0_30 (coord A2), U24[12]/P0_30-ISP_FC0_TXD
  @{ */
/* Routed pin properties */
#define BOARD_ISP_FC0_TXD_PERIPHERAL FLEXCOMM0               /*!<@brief Peripheral name */
#define BOARD_ISP_FC0_TXD_SIGNAL TXD_SCL_MISO                /*!<@brief Signal name */
#define BOARD_ISP_FC0_TXD_PIN_NAME FC0_TXD_SCL_MISO          /*!<@brief Routed pin name */
#define BOARD_ISP_FC0_TXD_LABEL "U24[12]/P0_30-ISP_FC0_TXD"  /*!<@brief Label */
#define BOARD_ISP_FC0_TXD_NAME "ISP_FC0_TXD"                 /*!<@brief Identifier */
#define BOARD_ISP_FC0_TXD_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
#define BOARD_ISP_FC0_TXD_PORT 0U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC0_TXD_PIN 30U                            /*!<@brief PORT pin number */
#define BOARD_ISP_FC0_TXD_PIN_MASK (1U << 30U)               /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M4F */

#define PIO010_ANAMODE_DISABLED 0x01u /*!<@brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO010_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO010_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO011_ANAMODE_DISABLED 0x01u /*!<@brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO011_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO011_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO012_ANAMODE_DISABLED 0x01u /*!<@brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO012_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO012_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */

/*! @name PIO0_12 (coord M3), P1[2]/U22[4]/D5[5]/IF_SWDIO
  @{ */
/* Routed pin properties */
#define BOARD_IF_SWDIO_PERIPHERAL SWD                      /*!<@brief Peripheral name */
#define BOARD_IF_SWDIO_SIGNAL SWDIO                        /*!<@brief Signal name */
#define BOARD_IF_SWDIO_PIN_NAME SWDIO                      /*!<@brief Routed pin name */
#define BOARD_IF_SWDIO_LABEL "P1[2]/U22[4]/D5[5]/IF_SWDIO" /*!<@brief Label */
#define BOARD_IF_SWDIO_NAME "IF_SWDIO"                     /*!<@brief Identifier */
#define BOARD_IF_SWDIO_PORT 0U                             /*!<@brief PORT peripheral base pointer */
#define BOARD_IF_SWDIO_PIN 12U                             /*!<@brief PORT pin number */
#define BOARD_IF_SWDIO_PIN_MASK (1U << 12U)                /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO0_11 (coord L3), U16[4]/SWDCLK_TRGT
  @{ */
/* Routed pin properties */
#define BOARD_SWDCLK_TRGT_PERIPHERAL SWD             /*!<@brief Peripheral name */
#define BOARD_SWDCLK_TRGT_SIGNAL SWCLK               /*!<@brief Signal name */
#define BOARD_SWDCLK_TRGT_PIN_NAME SWCLK             /*!<@brief Routed pin name */
#define BOARD_SWDCLK_TRGT_LABEL "U16[4]/SWDCLK_TRGT" /*!<@brief Label */
#define BOARD_SWDCLK_TRGT_NAME "SWDCLK_TRGT"         /*!<@brief Identifier */
#define BOARD_SWDCLK_TRGT_PORT 0U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_SWDCLK_TRGT_PIN 11U                    /*!<@brief PORT pin number */
#define BOARD_SWDCLK_TRGT_PIN_MASK (1U << 11U)       /*!<@brief PORT pin mask */
                                                     /* @} */

