nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*! @name PIO0_10 (coord P2), U16[12]/SWO_TRGT
  @{ */
/* Routed pin properties */
#define BOARD_SWO_TRGT_PERIPHERAL SWD            /*!<@brief Peripheral name */
#define BOARD_SWO_TRGT_SIGNAL SWO                /*!<@brief Signal name */
#define BOARD_SWO_TRGT_PIN_NAME SWO              /*!<@brief Routed pin name */
#define BOARD_SWO_TRGT_LABEL "U16[12]/SWO_TRGT"  /*!<@brief Label */
#define BOARD_SWO_TRGT_NAME "SWO_TRGT"           /*!<@brief Identifier */
#define BOARD_SWO_TRGT_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SWO_TRGT_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_SWO_TRGT_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWD_DEBUGPins(void); /* Function assigned for the Cortex-M4F */

#define PIO211_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO211_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO213_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO213_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO214_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO214_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO215_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO215_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO216_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO216_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO221_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO221_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO222_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO222_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO223_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO223_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO224_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO224_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO225_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO225_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO228_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO228_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO229_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO229_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO230_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO230_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO231_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO231_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO30_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO30_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO31_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO31_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO35_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO35_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO36_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO36_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO37_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO37_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO38_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO38_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO39_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO39_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */

/*! @name PIO2_11 (coord K3), J16[31]/P2_11-LCD_PWR
  @{ */
/* Routed pin properties */
#define BOARD_LCD_PWR_PERIPHERAL LCD                /*!<@brief Peripheral name */
#define BOARD_LCD_PWR_SIGNAL LCD_PWR                /*!<@brief Signal name */
#define BOARD_LCD_PWR_PIN_NAME LCD_PWR              /*!<@brief Routed pin name */
#define BOARD_LCD_PWR_LABEL "J16[31]/P2_11-LCD_PWR" /*!<@brief Label */
#define BOARD_LCD_PWR_NAME "LCD_PWR"                /*!<@brief Identifier */
#define BOARD_LCD_PWR_PORT 2U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_PWR_PIN 11U                       /*!<@brief PORT pin number */
#define BOARD_LCD_PWR_PIN_MASK (1U << 11U)          /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO2_14 (coord L7), J16[33]/P2_14-LCD_FP
  @{ */
/* Routed pin properties */
#define BOARD_LCD_FP_PERIPHERAL LCD               /*!<@brief Peripheral name */
#define BOARD_LCD_FP_SIGNAL LCD_FP                /*!<@brief Signal name */
#define BOARD_LCD_FP_PIN_NAME LCD_FP              /*!<@brief Routed pin name */
#define BOARD_LCD_FP_LABEL "J16[33]/P2_14-LCD_FP" /*!<@brief Label */
#define BOARD_LCD_FP_NAME "LCD_FP"                /*!<@brief Identifier */
#define BOARD_LCD_FP_PORT 2U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_FP_PIN 14U                      /*!<@brief PORT pin number */
#define BOARD_LCD_FP_PIN_MASK (1U << 14U)         /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO2_13 (coord P7), J16[30]/P2_13-LCD_DCLK
  @{ */
/* Routed pin properties */
#define BOARD_LCD_DCLK_PERIPHERAL LCD                 /*!<@brief Peripheral name */
#define BOARD_LCD_DCLK_SIGNAL LCD_DCLK                /*!<@brief Signal name */
#define BOARD_LCD_DCLK_PIN_NAME LCD_DCLK              /*!<@brief Routed pin name */
#define BOARD_LCD_DCLK_LABEL "J16[30]/P2_13-LCD_DCLK" /*!<@brief Label */
#define BOARD_LCD_DCLK_NAME "LCD_DCLK"                /*!<@brief Identifier */
#define BOARD_LCD_DCLK_PORT 2U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_DCLK_PIN 13U                        /*!<@brief PORT pin number */
#define BOARD_LCD_DCLK_PIN_MASK (1U << 13U)           /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO2_16 (coord L8), J16[32]/P2_16-LCD_LP
  @{ */
/* Routed pin properties */
#define BOARD_LCD_LP_PERIPHERAL LCD               /*!<@brief Peripheral name */
#define BOARD_LCD_LP_SIGNAL LCD_LP                /*!<@brief Signal name */
#define BOARD_LCD_LP_PIN_NAME LCD_LP              /*!<@brief Routed pin name */
#define BOARD_LCD_LP_LABEL "J16[32]/P2_16-LCD_LP" /*!<@brief Label */
#define BOARD_LCD_LP_NAME "LCD_LP"                /*!<@brief Identifier */
#define BOARD_LCD_LP_PORT 2U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_LP_PIN 16U                      /*!<@brief PORT pin number */
#define BOARD_LCD_LP_PIN_MASK (1U << 16U)         /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO2_15 (coord M8), J16[34]/P2_15-LCD_AC_ENAB_M
  @{ */
/* Routed pin properties */
#define BOARD_LCD_AC_ENAB_M_PERIPHERAL LCD                      /*!<@brief Peripheral name */
#define BOARD_LCD_AC_ENAB_M_SIGNAL LCD_AC                       /*!<@brief Signal name */
#define BOARD_LCD_AC_ENAB_M_PIN_NAME LCD_AC                     /*!<@brief Routed pin name */
#define BOARD_LCD_AC_ENAB_M_LABEL "J16[34]/P2_15-LCD_AC_ENAB_M" /*!<@brief Label */
#define BOARD_LCD_AC_ENAB_M_NAME "LCD_AC_ENAB_M"                /*!<@brief Identifier */
#define BOARD_LCD_AC_ENAB_M_PORT 2U                             /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_AC_ENAB_M_PIN 15U                             /*!<@brief PORT pin number */
#define BOARD_LCD_AC_ENAB_M_PIN_MASK (1U << 15U)                /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO2_22 (coord K10), J16[9]/P2_22-LCD_VD4
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD4_PERIPHERAL LCD               /*!<@brief Peripheral name */
#define BOARD_LCD_VD4_SIGNAL LCD_VD                /*!<@brief Signal name */
#define BOARD_LCD_VD4_CHANNEL 4                    /*!<@brief Signal channel */
#define BOARD_LCD_VD4_PIN_NAME LCD_VD(4)           /*!<@brief Routed pin name */
#define BOARD_LCD_VD4_LABEL "J16[9]/P2_22-LCD_VD4" /*!<@brief Label */
#define BOARD_LCD_VD4_NAME "LCD_VD4"               /*!<@brief Identifier */
#define BOARD_LCD_VD4_PORT 2U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD4_PIN 22U                      /*!<@brief PORT pin number */
#define BOARD_LCD_VD4_PIN_MASK (1U << 22U)         /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO2_21 (coord L10), J16[8]/P2_21-LCD_VD3
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD3_PERIPHERAL LCD               /*!<@brief Peripheral name */
#define BOARD_LCD_VD3_SIGNAL LCD_VD                /*!<@brief Signal name */
#define BOARD_LCD_VD3_CHANNEL 3                    /*!<@brief Signal channel */
#define BOARD_LCD_VD3_PIN_NAME LCD_VD(3)           /*!<@brief Routed pin name */
#define BOARD_LCD_VD3_LABEL "J16[8]/P2_21-LCD_VD3" /*!<@brief Label */
#define BOARD_LCD_VD3_NAME "LCD_VD3"               /*!<@brief Identifier */
#define BOARD_LCD_VD3_PORT 2U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD3_PIN 21U                      /*!<@brief PORT pin number */
#define BOARD_LCD_VD3_PIN_MASK (1U << 21U)         /*!<@brief PORT pin mask */
                                                   /* @} */

