nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*! @name PIO2_29 (coord G11), J16[16]/P2_29-LCD_VD11
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD11_PERIPHERAL LCD                 /*!<@brief Peripheral name */
#define BOARD_LCD_VD11_SIGNAL LCD_VD                  /*!<@brief Signal name */
#define BOARD_LCD_VD11_CHANNEL 11                     /*!<@brief Signal channel */
#define BOARD_LCD_VD11_PIN_NAME LCD_VD(11)            /*!<@brief Routed pin name */
#define BOARD_LCD_VD11_LABEL "J16[16]/P2_29-LCD_VD11" /*!<@brief Label */
#define BOARD_LCD_VD11_NAME "LCD_VD11"                /*!<@brief Identifier */
#define BOARD_LCD_VD11_PORT 2U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD11_PIN 29U                        /*!<@brief PORT pin number */
#define BOARD_LCD_VD11_PIN_MASK (1U << 29U)           /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO2_25 (coord J11), J16[12]/P2_25-LCD_VD7
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD7_PERIPHERAL LCD                /*!<@brief Peripheral name */
#define BOARD_LCD_VD7_SIGNAL LCD_VD                 /*!<@brief Signal name */
#define BOARD_LCD_VD7_CHANNEL 7                     /*!<@brief Signal channel */
#define BOARD_LCD_VD7_PIN_NAME LCD_VD(7)            /*!<@brief Routed pin name */
#define BOARD_LCD_VD7_LABEL "J16[12]/P2_25-LCD_VD7" /*!<@brief Label */
#define BOARD_LCD_VD7_NAME "LCD_VD7"                /*!<@brief Identifier */
#define BOARD_LCD_VD7_PORT 2U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD7_PIN 25U                       /*!<@brief PORT pin number */
#define BOARD_LCD_VD7_PIN_MASK (1U << 25U)          /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO2_30 (coord F12), J16[17]/P2_30-LCD_VD12
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD12_PERIPHERAL LCD                 /*!<@brief Peripheral name */
#define BOARD_LCD_VD12_SIGNAL LCD_VD                  /*!<@brief Signal name */
#define BOARD_LCD_VD12_CHANNEL 12                     /*!<@brief Signal channel */
#define BOARD_LCD_VD12_PIN_NAME LCD_VD(12)            /*!<@brief Routed pin name */
#define BOARD_LCD_VD12_LABEL "J16[17]/P2_30-LCD_VD12" /*!<@brief Label */
#define BOARD_LCD_VD12_NAME "LCD_VD12"                /*!<@brief Identifier */
#define BOARD_LCD_VD12_PORT 2U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD12_PIN 30U                        /*!<@brief PORT pin number */
#define BOARD_LCD_VD12_PIN_MASK (1U << 30U)           /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO2_28 (coord G13), J16[15]/P2_28-LCD_VD10
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD10_PERIPHERAL LCD                 /*!<@brief Peripheral name */
#define BOARD_LCD_VD10_SIGNAL LCD_VD                  /*!<@brief Signal name */
#define BOARD_LCD_VD10_CHANNEL 10                     /*!<@brief Signal channel */
#define BOARD_LCD_VD10_PIN_NAME LCD_VD(10)            /*!<@brief Routed pin name */
#define BOARD_LCD_VD10_LABEL "J16[15]/P2_28-LCD_VD10" /*!<@brief Label */
#define BOARD_LCD_VD10_NAME "LCD_VD10"                /*!<@brief Identifier */
#define BOARD_LCD_VD10_PORT 2U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD10_PIN 28U                        /*!<@brief PORT pin number */
#define BOARD_LCD_VD10_PIN_MASK (1U << 28U)           /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO2_31 (coord D14), J16[18]/P2_31-LCD_VD13
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD13_PERIPHERAL LCD                 /*!<@brief Peripheral name */
#define BOARD_LCD_VD13_SIGNAL LCD_VD                  /*!<@brief Signal name */
#define BOARD_LCD_VD13_CHANNEL 13                     /*!<@brief Signal channel */
#define BOARD_LCD_VD13_PIN_NAME LCD_VD(13)            /*!<@brief Routed pin name */
#define BOARD_LCD_VD13_LABEL "J16[18]/P2_31-LCD_VD13" /*!<@brief Label */
#define BOARD_LCD_VD13_NAME "LCD_VD13"                /*!<@brief Identifier */
#define BOARD_LCD_VD13_PORT 2U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD13_PIN 31U                        /*!<@brief PORT pin number */
#define BOARD_LCD_VD13_PIN_MASK (1U << 31U)           /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO2_24 (coord K14), J16[11]/P2_24-LCD_VD6
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD6_PERIPHERAL LCD                /*!<@brief Peripheral name */
#define BOARD_LCD_VD6_SIGNAL LCD_VD                 /*!<@brief Signal name */
#define BOARD_LCD_VD6_CHANNEL 6                     /*!<@brief Signal channel */
#define BOARD_LCD_VD6_PIN_NAME LCD_VD(6)            /*!<@brief Routed pin name */
#define BOARD_LCD_VD6_LABEL "J16[11]/P2_24-LCD_VD6" /*!<@brief Label */
#define BOARD_LCD_VD6_NAME "LCD_VD6"                /*!<@brief Identifier */
#define BOARD_LCD_VD6_PORT 2U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD6_PIN 24U                       /*!<@brief PORT pin number */
#define BOARD_LCD_VD6_PIN_MASK (1U << 24U)          /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO2_23 (coord M14), J16[10]/P2_23-LCD_VD5
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD5_PERIPHERAL LCD                /*!<@brief Peripheral name */
#define BOARD_LCD_VD5_SIGNAL LCD_VD                 /*!<@brief Signal name */
#define BOARD_LCD_VD5_CHANNEL 5                     /*!<@brief Signal channel */
#define BOARD_LCD_VD5_PIN_NAME LCD_VD(5)            /*!<@brief Routed pin name */
#define BOARD_LCD_VD5_LABEL "J16[10]/P2_23-LCD_VD5" /*!<@brief Label */
#define BOARD_LCD_VD5_NAME "LCD_VD5"                /*!<@brief Identifier */
#define BOARD_LCD_VD5_PORT 2U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD5_PIN 23U                       /*!<@brief PORT pin number */
#define BOARD_LCD_VD5_PIN_MASK (1U << 23U)          /*!<@brief PORT pin mask */
                                                    /* @} */

