nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*! @name PIO3_0 (coord D12), J16[19]/JS36[1]/P3_0-LCD_VD14
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD14_PERIPHERAL LCD                        /*!<@brief Peripheral name */
#define BOARD_LCD_VD14_SIGNAL LCD_VD                         /*!<@brief Signal name */
#define BOARD_LCD_VD14_CHANNEL 14                            /*!<@brief Signal channel */
#define BOARD_LCD_VD14_PIN_NAME LCD_VD(14)                   /*!<@brief Routed pin name */
#define BOARD_LCD_VD14_LABEL "J16[19]/JS36[1]/P3_0-LCD_VD14" /*!<@brief Label */
#define BOARD_LCD_VD14_NAME "LCD_VD14"                       /*!<@brief Identifier */
#define BOARD_LCD_VD14_PORT 3U                               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD14_PIN 0U                                /*!<@brief PORT pin number */
#define BOARD_LCD_VD14_PIN_MASK (1U << 0U)                   /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO3_1 (coord D11), J16[20]/JS33[1]/P3_1-LCD_VD15
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD15_PERIPHERAL LCD                        /*!<@brief Peripheral name */
#define BOARD_LCD_VD15_SIGNAL LCD_VD                         /*!<@brief Signal name */
#define BOARD_LCD_VD15_CHANNEL 15                            /*!<@brief Signal channel */
#define BOARD_LCD_VD15_PIN_NAME LCD_VD(15)                   /*!<@brief Routed pin name */
#define BOARD_LCD_VD15_LABEL "J16[20]/JS33[1]/P3_1-LCD_VD15" /*!<@brief Label */
#define BOARD_LCD_VD15_NAME "LCD_VD15"                       /*!<@brief Identifier */
#define BOARD_LCD_VD15_PORT 3U                               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD15_PIN 1U                                /*!<@brief PORT pin number */
#define BOARD_LCD_VD15_PIN_MASK (1U << 1U)                   /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO3_5 (coord B10), J16[24]/P3_5-LCD_VD19
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD19_PERIPHERAL LCD                /*!<@brief Peripheral name */
#define BOARD_LCD_VD19_SIGNAL LCD_VD                 /*!<@brief Signal name */
#define BOARD_LCD_VD19_CHANNEL 19                    /*!<@brief Signal channel */
#define BOARD_LCD_VD19_PIN_NAME LCD_VD(19)           /*!<@brief Routed pin name */
#define BOARD_LCD_VD19_LABEL "J16[24]/P3_5-LCD_VD19" /*!<@brief Label */
#define BOARD_LCD_VD19_NAME "LCD_VD19"               /*!<@brief Identifier */
#define BOARD_LCD_VD19_PORT 3U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD19_PIN 5U                        /*!<@brief PORT pin number */
#define BOARD_LCD_VD19_PIN_MASK (1U << 5U)           /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO3_6 (coord C9), J16[25]/P3_6-LCD_VD20
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD20_PERIPHERAL LCD                /*!<@brief Peripheral name */
#define BOARD_LCD_VD20_SIGNAL LCD_VD                 /*!<@brief Signal name */
#define BOARD_LCD_VD20_CHANNEL 20                    /*!<@brief Signal channel */
#define BOARD_LCD_VD20_PIN_NAME LCD_VD(20)           /*!<@brief Routed pin name */
#define BOARD_LCD_VD20_LABEL "J16[25]/P3_6-LCD_VD20" /*!<@brief Label */
#define BOARD_LCD_VD20_NAME "LCD_VD20"               /*!<@brief Identifier */
#define BOARD_LCD_VD20_PORT 3U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD20_PIN 6U                        /*!<@brief PORT pin number */
#define BOARD_LCD_VD20_PIN_MASK (1U << 6U)           /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO3_7 (coord B8), J16[26]/P3_7-LCD_VD21
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD21_PERIPHERAL LCD                /*!<@brief Peripheral name */
#define BOARD_LCD_VD21_SIGNAL LCD_VD                 /*!<@brief Signal name */
#define BOARD_LCD_VD21_CHANNEL 21                    /*!<@brief Signal channel */
#define BOARD_LCD_VD21_PIN_NAME LCD_VD(21)           /*!<@brief Routed pin name */
#define BOARD_LCD_VD21_LABEL "J16[26]/P3_7-LCD_VD21" /*!<@brief Label */
#define BOARD_LCD_VD21_NAME "LCD_VD21"               /*!<@brief Identifier */
#define BOARD_LCD_VD21_PORT 3U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD21_PIN 7U                        /*!<@brief PORT pin number */
#define BOARD_LCD_VD21_PIN_MASK (1U << 7U)           /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO3_8 (coord A7), J16[27]/P3_8-LCD_VD22
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD22_PERIPHERAL LCD                /*!<@brief Peripheral name */
#define BOARD_LCD_VD22_SIGNAL LCD_VD                 /*!<@brief Signal name */
#define BOARD_LCD_VD22_CHANNEL 22                    /*!<@brief Signal channel */
#define BOARD_LCD_VD22_PIN_NAME LCD_VD(22)           /*!<@brief Routed pin name */
#define BOARD_LCD_VD22_LABEL "J16[27]/P3_8-LCD_VD22" /*!<@brief Label */
#define BOARD_LCD_VD22_NAME "LCD_VD22"               /*!<@brief Identifier */
#define BOARD_LCD_VD22_PORT 3U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD22_PIN 8U                        /*!<@brief PORT pin number */
#define BOARD_LCD_VD22_PIN_MASK (1U << 8U)           /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO3_9 (coord C7), J16[28]/P3_9-LCD_VD23
  @{ */
/* Routed pin properties */
#define BOARD_LCD_VD23_PERIPHERAL LCD                /*!<@brief Peripheral name */
#define BOARD_LCD_VD23_SIGNAL LCD_VD                 /*!<@brief Signal name */
#define BOARD_LCD_VD23_CHANNEL 23                    /*!<@brief Signal channel */
#define BOARD_LCD_VD23_PIN_NAME LCD_VD(23)           /*!<@brief Routed pin name */
#define BOARD_LCD_VD23_LABEL "J16[28]/P3_9-LCD_VD23" /*!<@brief Label */
#define BOARD_LCD_VD23_NAME "LCD_VD23"               /*!<@brief Identifier */
#define BOARD_LCD_VD23_PORT 3U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_VD23_PIN 9U                        /*!<@brief PORT pin number */
#define BOARD_LCD_VD23_PIN_MASK (1U << 9U)           /*!<@brief PORT pin mask */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLCDPins(void); /* Function assigned for the Cortex-M4F */

#define PIO017_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO017_FUNC_ALT7 0x07u        /*!<@brief Selects pin function.: Alternative connection 7. */
#define PIO226_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO226_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO410_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO410_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO411_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO411_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO412_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO412_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO413_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO413_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO414_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO414_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO415_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO415_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO416_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO416_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO48_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO48_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */

/*! @name PIO4_8 (coord B14), U12[17]/JP11[1]/P4_8-ENET_TXD0
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITENETPINS_ENET_TXD0_PERIPHERAL ENET
/*!
 * @brief Signal name */
#define BOARD_INITENETPINS_ENET_TXD0_SIGNAL ENET_TXD
/*!
 * @brief Signal channel */
#define BOARD_INITENETPINS_ENET_TXD0_CHANNEL 0
/*!
 * @brief Routed pin name */
#define BOARD_INITENETPINS_ENET_TXD0_PIN_NAME ENET_TXD0
/*!
 * @brief Label */
#define BOARD_INITENETPINS_ENET_TXD0_LABEL "U12[17]/JP11[1]/P4_8-ENET_TXD0"
/*!
 * @brief Identifier */
#define BOARD_INITENETPINS_ENET_TXD0_NAME "ENET_TXD0"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITENETPINS_ENET_TXD0_PORT 4U
/*!
 * @brief PORT pin number */
#define BOARD_INITENETPINS_ENET_TXD0_PIN 8U
/*!
 * @brief PORT pin mask */
#define BOARD_INITENETPINS_ENET_TXD0_PIN_MASK (1U << 8U)
/* @} */

/*! @name PIO0_17 (coord E14), U12[18]/P0_17-ENET_TXD1
  @{ */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TXD1_PERIPHERAL ENET                 /*!<@brief Peripheral name */
#define BOARD_INITENETPINS_ENET_TXD1_SIGNAL ENET_TXD                 /*!<@brief Signal name */
#define BOARD_INITENETPINS_ENET_TXD1_CHANNEL 1                       /*!<@brief Signal channel */
#define BOARD_INITENETPINS_ENET_TXD1_PIN_NAME ENET_TXD1              /*!<@brief Routed pin name */
#define BOARD_INITENETPINS_ENET_TXD1_LABEL "U12[18]/P0_17-ENET_TXD1" /*!<@brief Label */
#define BOARD_INITENETPINS_ENET_TXD1_NAME "ENET_TXD1"                /*!<@brief Identifier */
#define BOARD_INITENETPINS_ENET_TXD1_PORT 0U                         /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENETPINS_ENET_TXD1_PIN 17U                         /*!<@brief PORT pin number */
#define BOARD_INITENETPINS_ENET_TXD1_PIN_MASK (1U << 17U)            /*!<@brief PORT pin mask */
                                                                     /* @} */

