nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*! @name PIO4_13 (coord B6), U12[16]/P4_13-ENET_TX_EN
  @{ */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TX_EN_PERIPHERAL ENET                  /*!<@brief Peripheral name */
#define BOARD_INITENETPINS_ENET_TX_EN_SIGNAL ENET_TX_EN                /*!<@brief Signal name */
#define BOARD_INITENETPINS_ENET_TX_EN_PIN_NAME ENET_TX_EN              /*!<@brief Routed pin name */
#define BOARD_INITENETPINS_ENET_TX_EN_LABEL "U12[16]/P4_13-ENET_TX_EN" /*!<@brief Label */
#define BOARD_INITENETPINS_ENET_TX_EN_NAME "ENET_TX_EN"                /*!<@brief Identifier */
#define BOARD_INITENETPINS_ENET_TX_EN_PORT 4U                          /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENETPINS_ENET_TX_EN_PIN 13U                          /*!<@brief PORT pin number */
#define BOARD_INITENETPINS_ENET_TX_EN_PIN_MASK (1U << 13U)             /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO4_11 (coord A9), U12[8]/JP12[1]/J3[4]/JP12[3]/P4_11-USB0_ID/P4_11-ENET_RXD0
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITENETPINS_ENET_RXD0_PERIPHERAL ENET
/*!
 * @brief Signal name */
#define BOARD_INITENETPINS_ENET_RXD0_SIGNAL ENET_RXD
/*!
 * @brief Signal channel */
#define BOARD_INITENETPINS_ENET_RXD0_CHANNEL 0
/*!
 * @brief Routed pin name */
#define BOARD_INITENETPINS_ENET_RXD0_PIN_NAME ENET_RXD0
/*!
 * @brief Label */
#define BOARD_INITENETPINS_ENET_RXD0_LABEL "U12[8]/JP12[1]/J3[4]/JP12[3]/P4_11-USB0_ID/P4_11-ENET_RXD0"
/*!
 * @brief Identifier */
#define BOARD_INITENETPINS_ENET_RXD0_NAME "ENET_RXD0"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITENETPINS_ENET_RXD0_PORT 4U
/*!
 * @brief PORT pin number */
#define BOARD_INITENETPINS_ENET_RXD0_PIN 11U
/*!
 * @brief PORT pin mask */
#define BOARD_INITENETPINS_ENET_RXD0_PIN_MASK (1U << 11U)
/* @} */

/*! @name PIO4_12 (coord A6), U12[7]/P4_12-ENET_RXD1
  @{ */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_RXD1_PERIPHERAL ENET                /*!<@brief Peripheral name */
#define BOARD_INITENETPINS_ENET_RXD1_SIGNAL ENET_RXD                /*!<@brief Signal name */
#define BOARD_INITENETPINS_ENET_RXD1_CHANNEL 1                      /*!<@brief Signal channel */
#define BOARD_INITENETPINS_ENET_RXD1_PIN_NAME ENET_RXD1             /*!<@brief Routed pin name */
#define BOARD_INITENETPINS_ENET_RXD1_LABEL "U12[7]/P4_12-ENET_RXD1" /*!<@brief Label */
#define BOARD_INITENETPINS_ENET_RXD1_NAME "ENET_RXD1"               /*!<@brief Identifier */
#define BOARD_INITENETPINS_ENET_RXD1_PORT 4U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENETPINS_ENET_RXD1_PIN 12U                        /*!<@brief PORT pin number */
#define BOARD_INITENETPINS_ENET_RXD1_PIN_MASK (1U << 12U)           /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO4_10 (coord B9), U12[11]/P4_10-ENET_CRS_DV
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITENETPINS_ENET_CRS_DV_PERIPHERAL ENET
/*!
 * @brief Signal name */
#define BOARD_INITENETPINS_ENET_CRS_DV_SIGNAL ENET_RX_DV
/*!
 * @brief Routed pin name */
#define BOARD_INITENETPINS_ENET_CRS_DV_PIN_NAME ENET_RX_DV
/*!
 * @brief Label */
#define BOARD_INITENETPINS_ENET_CRS_DV_LABEL "U12[11]/P4_10-ENET_CRS_DV"
/*!
 * @brief Identifier */
#define BOARD_INITENETPINS_ENET_CRS_DV_NAME "ENET_CRS_DV"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITENETPINS_ENET_CRS_DV_PORT 4U
/*!
 * @brief PORT pin number */
#define BOARD_INITENETPINS_ENET_CRS_DV_PIN 10U
/*!
 * @brief PORT pin mask */
#define BOARD_INITENETPINS_ENET_CRS_DV_PIN_MASK (1U << 10U)
/* @} */

/*! @name PIO4_16 (coord C4), U12[12]/P4_16-ENET_MDIO
  @{ */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_MDIO_PERIPHERAL ENET                 /*!<@brief Peripheral name */
#define BOARD_INITENETPINS_ENET_MDIO_SIGNAL ENET_MDIO                /*!<@brief Signal name */
#define BOARD_INITENETPINS_ENET_MDIO_PIN_NAME ENET_MDIO              /*!<@brief Routed pin name */
#define BOARD_INITENETPINS_ENET_MDIO_LABEL "U12[12]/P4_16-ENET_MDIO" /*!<@brief Label */
#define BOARD_INITENETPINS_ENET_MDIO_NAME "ENET_MDIO"                /*!<@brief Identifier */
#define BOARD_INITENETPINS_ENET_MDIO_PORT 4U                         /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENETPINS_ENET_MDIO_PIN 16U                         /*!<@brief PORT pin number */
#define BOARD_INITENETPINS_ENET_MDIO_PIN_MASK (1U << 16U)            /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO4_15 (coord A4), U12[13]/P4_15-ENET_MDC
  @{ */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_MDC_PERIPHERAL ENET                /*!<@brief Peripheral name */
#define BOARD_INITENETPINS_ENET_MDC_SIGNAL ENET_MDC                /*!<@brief Signal name */
#define BOARD_INITENETPINS_ENET_MDC_PIN_NAME ENET_MDC              /*!<@brief Routed pin name */
#define BOARD_INITENETPINS_ENET_MDC_LABEL "U12[13]/P4_15-ENET_MDC" /*!<@brief Label */
#define BOARD_INITENETPINS_ENET_MDC_NAME "ENET_MDC"                /*!<@brief Identifier */
#define BOARD_INITENETPINS_ENET_MDC_PORT 4U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENETPINS_ENET_MDC_PIN 15U                        /*!<@brief PORT pin number */
#define BOARD_INITENETPINS_ENET_MDC_PIN_MASK (1U << 15U)           /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO2_26 (coord H11), U12[15]/P2_26-ENET_PHY_RSTn
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_SIGNAL PIO2
/*!
 * @brief Signal channel */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_CHANNEL 26
/*!
 * @brief Routed pin name */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_PIN_NAME PIO2_26
/*!
 * @brief Label */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_LABEL "U12[15]/P2_26-ENET_PHY_RSTn"
/*!
 * @brief Identifier */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_NAME "ENET_PHY_RSTn"
/*!
 * @brief Direction */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_DIRECTION kPIN_MUX_DirectionOutput

