nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_GPIO GPIO
/*!
 * @brief GPIO pin number */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_GPIO_PIN 26U
/*!
 * @brief GPIO pin mask */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_GPIO_PIN_MASK (1U << 26U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_PIN 26U
/*!
 * @brief PORT pin mask */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_PIN_MASK (1U << 26U)
/* @} */

/*! @name PIO4_14 (coord B5), JS18[2]/P4_14-ENET_RX_CLK
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITENETPINS_ENET_RX_CLK_PERIPHERAL ENET
/*!
 * @brief Signal name */
#define BOARD_INITENETPINS_ENET_RX_CLK_SIGNAL ENET_RX_CLK
/*!
 * @brief Routed pin name */
#define BOARD_INITENETPINS_ENET_RX_CLK_PIN_NAME ENET_RX_CLK
/*!
 * @brief Label */
#define BOARD_INITENETPINS_ENET_RX_CLK_LABEL "JS18[2]/P4_14-ENET_RX_CLK"
/*!
 * @brief Identifier */
#define BOARD_INITENETPINS_ENET_RX_CLK_NAME "ENET_RX_CLK"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITENETPINS_ENET_RX_CLK_PORT 4U
/*!
 * @brief PORT pin number */
#define BOARD_INITENETPINS_ENET_RX_CLK_PIN 14U
/*!
 * @brief PORT pin mask */
#define BOARD_INITENETPINS_ENET_RX_CLK_PIN_MASK (1U << 14U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENETPins(void); /* Function assigned for the Cortex-M4F */

#define PIO12_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO12_FUNC_ALT5 0x05u        /*!<@brief Selects pin function.: Alternative connection 5. */
#define PIO13_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO13_FUNC_ALT5 0x05u        /*!<@brief Selects pin function.: Alternative connection 5. */

/*! @name PIO1_2 (coord L14), J13[18]/JS25[3]/DMIC1[4]/P1_2-PDM1_CLK
  @{ */
/* Routed pin properties */
#define BOARD_PDM1_CLK_PERIPHERAL DMIC0                               /*!<@brief Peripheral name */
#define BOARD_PDM1_CLK_SIGNAL CLK                                     /*!<@brief Signal name */
#define BOARD_PDM1_CLK_CHANNEL 1                                      /*!<@brief Signal channel */
#define BOARD_PDM1_CLK_PIN_NAME PDM1_CLK                              /*!<@brief Routed pin name */
#define BOARD_PDM1_CLK_LABEL "J13[18]/JS25[3]/DMIC1[4]/P1_2-PDM1_CLK" /*!<@brief Label */
#define BOARD_PDM1_CLK_NAME "PDM1_CLK"                                /*!<@brief Identifier */
#define BOARD_PDM1_CLK_PORT 1U                                        /*!<@brief PORT peripheral base pointer */
#define BOARD_PDM1_CLK_PIN 2U                                         /*!<@brief PORT pin number */
#define BOARD_PDM1_CLK_PIN_MASK (1U << 2U)                            /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO1_3 (coord J13), JS26[3]/DMIC1[1]/P1_3-PDM1_DATA
  @{ */
/* Routed pin properties */
#define BOARD_PDM1_DATA_PERIPHERAL DMIC0                        /*!<@brief Peripheral name */
#define BOARD_PDM1_DATA_SIGNAL DATA                             /*!<@brief Signal name */
#define BOARD_PDM1_DATA_CHANNEL 1                               /*!<@brief Signal channel */
#define BOARD_PDM1_DATA_PIN_NAME PDM1_DATA                      /*!<@brief Routed pin name */
#define BOARD_PDM1_DATA_LABEL "JS26[3]/DMIC1[1]/P1_3-PDM1_DATA" /*!<@brief Label */
#define BOARD_PDM1_DATA_NAME "PDM1_DATA"                        /*!<@brief Identifier */
#define BOARD_PDM1_DATA_PORT 1U                                 /*!<@brief PORT peripheral base pointer */
#define BOARD_PDM1_DATA_PIN 3U                                  /*!<@brief PORT pin number */
#define BOARD_PDM1_DATA_PIN_MASK (1U << 3U)                     /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDMICPins(void); /* Function assigned for the Cortex-M4F */

#define PIO218_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO218_FUNC_ALT3 0x03u        /*!<@brief Selects pin function.: Alternative connection 3. */
#define PIO219_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO219_FUNC_ALT3 0x03u        /*!<@brief Selects pin function.: Alternative connection 3. */
#define PIO220_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO220_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO311_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO311_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO323_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO323_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO324_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO324_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO41_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO41_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO42_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO42_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO43_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO43_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */

/*! @name PIO4_1 (coord G14), U10[29]/J9[14]/P4_1-FC6_I2S_TX_SCK
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_FC6_I2S_TX_SCK_PERIPHERAL FLEXCOMM6
/*!
 * @brief Signal name */
#define BOARD_FC6_I2S_TX_SCK_SIGNAL SCK
/*!
 * @brief Routed pin name */
#define BOARD_FC6_I2S_TX_SCK_PIN_NAME FC6_SCK
/*!
 * @brief Label */
#define BOARD_FC6_I2S_TX_SCK_LABEL "U10[29]/J9[14]/P4_1-FC6_I2S_TX_SCK"
/*!
 * @brief Identifier */
#define BOARD_FC6_I2S_TX_SCK_NAME "FC6_I2S_TX_SCK"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_FC6_I2S_TX_SCK_PORT 4U
/*!
 * @brief PORT pin number */
#define BOARD_FC6_I2S_TX_SCK_PIN 1U
/*!
 * @brief PORT pin mask */
#define BOARD_FC6_I2S_TX_SCK_PIN_MASK (1U << 1U)
/* @} */

