nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018/project_template/pin_mux.h
/*! @name PIO4_3 (coord F13), U10[30]/J9[12]/P4_3-FC6_I2S_TX_WS
  @{ */
/* Routed pin properties */
#define BOARD_FC6_I2S_TX_WS_PERIPHERAL FLEXCOMM6                      /*!<@brief Peripheral name */
#define BOARD_FC6_I2S_TX_WS_SIGNAL TXD_SCL_MISO_WS                    /*!<@brief Signal name */
#define BOARD_FC6_I2S_TX_WS_PIN_NAME FC6_TXD_SCL_MISO_WS              /*!<@brief Routed pin name */
#define BOARD_FC6_I2S_TX_WS_LABEL "U10[30]/J9[12]/P4_3-FC6_I2S_TX_WS" /*!<@brief Label */
#define BOARD_FC6_I2S_TX_WS_NAME "FC6_I2S_TX_WS"                      /*!<@brief Identifier */
#define BOARD_FC6_I2S_TX_WS_PORT 4U                                   /*!<@brief PORT peripheral base pointer */
#define BOARD_FC6_I2S_TX_WS_PIN 3U                                    /*!<@brief PORT pin number */
#define BOARD_FC6_I2S_TX_WS_PIN_MASK (1U << 3U)                       /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO4_2 (coord F14), U10[32]/J9[10]/P4_2-FC6_I2S_TX_DATA
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_FC6_I2S_TX_DATA_PERIPHERAL FLEXCOMM6
/*!
 * @brief Signal name */
#define BOARD_FC6_I2S_TX_DATA_SIGNAL RXD_SDA_MOSI_DATA
/*!
 * @brief Routed pin name */
#define BOARD_FC6_I2S_TX_DATA_PIN_NAME FC6_RXD_SDA_MOSI_DATA
/*!
 * @brief Label */
#define BOARD_FC6_I2S_TX_DATA_LABEL "U10[32]/J9[10]/P4_2-FC6_I2S_TX_DATA"
/*!
 * @brief Identifier */
#define BOARD_FC6_I2S_TX_DATA_NAME "FC6_I2S_TX_DATA"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_FC6_I2S_TX_DATA_PORT 4U
/*!
 * @brief PORT pin number */
#define BOARD_FC6_I2S_TX_DATA_PIN 2U
/*!
 * @brief PORT pin mask */
#define BOARD_FC6_I2S_TX_DATA_PIN_MASK (1U << 2U)
/* @} */

/*! @name PIO2_19 (coord P12), U10[31]/J9[20]/P2_19-FC7_I2S_RX_DAT
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_FC7_I2S_RX_DAT_PERIPHERAL FLEXCOMM7
/*!
 * @brief Signal name */
#define BOARD_FC7_I2S_RX_DAT_SIGNAL RXD_SDA_MOSI_DATA
/*!
 * @brief Routed pin name */
#define BOARD_FC7_I2S_RX_DAT_PIN_NAME FC7_RXD_SDA_MOSI_DATA
/*!
 * @brief Label */
#define BOARD_FC7_I2S_RX_DAT_LABEL "U10[31]/J9[20]/P2_19-FC7_I2S_RX_DAT"
/*!
 * @brief Identifier */
#define BOARD_FC7_I2S_RX_DAT_NAME "FC7_I2S_RX_DAT"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_FC7_I2S_RX_DAT_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_FC7_I2S_RX_DAT_PIN 19U
/*!
 * @brief PORT pin mask */
#define BOARD_FC7_I2S_RX_DAT_PIN_MASK (1U << 19U)
/* @} */

/*! @name PIO2_18 (coord N10), U10[29]/J9[16]/P2_18-FC7_I2S_RX_SCK
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_FC7_I2S_RX_SCK_PERIPHERAL FLEXCOMM7
/*!
 * @brief Signal name */
#define BOARD_FC7_I2S_RX_SCK_SIGNAL SCK
/*!
 * @brief Routed pin name */
#define BOARD_FC7_I2S_RX_SCK_PIN_NAME FC7_SCK
/*!
 * @brief Label */
#define BOARD_FC7_I2S_RX_SCK_LABEL "U10[29]/J9[16]/P2_18-FC7_I2S_RX_SCK"
/*!
 * @brief Identifier */
#define BOARD_FC7_I2S_RX_SCK_NAME "FC7_I2S_RX_SCK"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_FC7_I2S_RX_SCK_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_FC7_I2S_RX_SCK_PIN 18U
/*!
 * @brief PORT pin mask */
#define BOARD_FC7_I2S_RX_SCK_PIN_MASK (1U << 18U)
/* @} */

/*! @name PIO2_20 (coord P13), U10[30]/J9[18]/P2_20-FC7_I2S_RX_WS
  @{ */
/* Routed pin properties */
#define BOARD_FC7_I2S_RX_WS_PERIPHERAL FLEXCOMM3                       /*!<@brief Peripheral name */
#define BOARD_FC7_I2S_RX_WS_SIGNAL RTS_SCL_SSEL1                       /*!<@brief Signal name */
#define BOARD_FC7_I2S_RX_WS_PIN_NAME FC3_RTS_SCL_SSEL1                 /*!<@brief Routed pin name */
#define BOARD_FC7_I2S_RX_WS_LABEL "U10[30]/J9[18]/P2_20-FC7_I2S_RX_WS" /*!<@brief Label */
#define BOARD_FC7_I2S_RX_WS_NAME "FC7_I2S_RX_WS"                       /*!<@brief Identifier */
#define BOARD_FC7_I2S_RX_WS_PORT 2U                                    /*!<@brief PORT peripheral base pointer */
#define BOARD_FC7_I2S_RX_WS_PIN 20U                                    /*!<@brief PORT pin number */
#define BOARD_FC7_I2S_RX_WS_PIN_MASK (1U << 20U)                       /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO3_11 (coord B2), J11[8]/J12[7]/P3_11-MCLK-PMOD2_GPIO
  @{ */
/* Routed pin properties */
#define BOARD_MCLK_PERIPHERAL SYSCON                           /*!<@brief Peripheral name */
#define BOARD_MCLK_SIGNAL MCLK                                 /*!<@brief Signal name */
#define BOARD_MCLK_PIN_NAME MCLK                               /*!<@brief Routed pin name */
#define BOARD_MCLK_LABEL "J11[8]/J12[7]/P3_11-MCLK-PMOD2_GPIO" /*!<@brief Label */
#define BOARD_MCLK_NAME "MCLK"                                 /*!<@brief Identifier */
#define BOARD_MCLK_PORT 3U                                     /*!<@brief PORT peripheral base pointer */
#define BOARD_MCLK_PIN 11U                                     /*!<@brief PORT pin number */
#define BOARD_MCLK_PIN_MASK (1U << 11U)                        /*!<@brief PORT pin mask */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2SPins(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
